core-vfd-101/core-vfd.org
#+TITLE: Using Memory-Backed HDF5 Files to Reduce Storage Access and Size
#+AUTHOR: Gerd Heber
#+EMAIL: gheber@hdfgroup.org
#+DATE: 17 December 2020

#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>

#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper, 12pt]
#+LATEX_HEADER: \usepackage[a4paper,top=1cm,bottom=1cm,left=1cm,right=1cm]{geometry}

#+PROPERTY: header-args :eval never-export

* Introduction

  Logically, an HDF5 file stored in a file system is just a sequence of bytes
  formatted according to the HDF5 file format specification. Several factors
  affect the performance with which such a sequence can be manipulated,
  including (but not limited to) the latency and throughput of the underlying
  storage hardware. /Memory-backed HDF5 files/ eliminate this constraint by
  maintaining the underlying byte sequence in contiguous RAM buffers.

  The life-cycle of memory-backed HDF5 files is very simple:

  1. Instruct the HDF5 library to create an HDF5 file in memory rather than in
     a file system. (It is also possible to load existing HDF5 files into
     memory buffers.)
  2. For the lifetime of the application perform HDF5 I/O operations as usual.
  3. Before application shutdown decide whether to abandon the RAM buffer or to
     persist certain parts of it in an HDF5 file in a file system.

  The obvious use case for in-memory HDF5 files is their use as /I/O buffers/,
  for example, in applications with large numbers of small-size and
  random-access I/O operations. A second, often overlooked, use case is the
  ability to deal with a high degree of /uncertainty/, especially, in
  application backends. The idea is that by maintaining a memory-backed
  /shadow/ HDF5 file for such highly uncertain candidates, the decision about
  what to put into a persisted (in storage) HDF5 file can often be delayed,
  resulting in faster access and smaller files.

  The vehicle for implementing this behavior in the HDF5 library is the
  /virtual file layer/ (VFL), specifically, the so-called /core/ virtual file
  driver (VFD).  This is, however, not the place to learn about implementation
  details. See ??? for that.

  This document is organized as follows: First, we present three examples
  (sections [[sec:basic-use]], [[sec:copying-objects]], [[sec:delaying-decisions]]) with
  their code outlines and their actual behavior. In section
  [[sec:building-blocks]], we show the implementation of their (common) building
  blocks.

** Caveat Emptor

   The examples in this document are developed by incremental refinement. They
   are written in C in a style that we call /literate HDF5/. (See [[https://en.wikipedia.org/wiki/Literate_programming][Knuth1992]].)
   Each example is first outlined with placeholders inserted for code blocks
   developed later. That should make the program logic easy to follow, keep the
   noise-level down, and limit code repetition.

   This document ([[https://www.jstatsoft.org/article/view/v046i03][org file]]) is the /primary/ source for different artifacts
   such as other document formats (HTML, PDF, etc.) /and/ the actual source
   code (=*.c= files). Any change of this document will propagate
   automatically, making artifacts easy to maintain and to reproduce its
   results.

   This code is for illustration only. For example, no error detection or
   handling was attempted, and attentive readers will easily identify several
   corner cases that were not considered.

** Syntax

   The basic syntactic element to denote a code block with a deferred
   implementation follows this pattern:

   #+begin_example
   (*
     <<to-be-implemented>> ) (arg1, arg2, arg3, ...);
   #+end_example

   The syntax resembles a C function pointer, where =<<to-be-implemented>>=
   represents the code implementing the referenced function with arguments
   =arg1, arg2, arg3=, etc. Readers familiar with /lambda functions/ might find
   it convenient to think about these blocks as such. (If the examples were
   written in C++, that would be one way to go about it.)

