core-vfd-101/core-vfd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-27 Sun 16:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Memory-Backed HDF5 Files to Reduce Storage Access and Size</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Gerd Heber" />
<link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Using Memory-Backed HDF5 Files to Reduce Storage Access and Size</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga462c9c">1. Introduction</a>
<ul>
<li><a href="#org115be38">1.1. Caveat Emptor</a></li>
<li><a href="#org88588b4">1.2. Syntax</a></li>
<li><a href="#orga748cb1">1.3. Logistics</a></li>
</ul>
</li>
<li><a href="#org18f2cec">2. Basic Use  </a>
<ul>
<li><a href="#org0d0dcf9">2.1. Goal</a></li>
<li><a href="#orgb838191">2.2. Outline for an HDF5 file in a file system</a></li>
<li><a href="#org6229835">2.3. Outline for a memory-backed HDF5 file</a></li>
<li><a href="#orgb35dc7e">2.4. Discussion</a></li>
</ul>
</li>
<li><a href="#org5f0d7dc">3. Copying Objects </a>
<ul>
<li><a href="#org79c16b5">3.1. Goal</a></li>
<li><a href="#orgd99aff6">3.2. Outline</a></li>
<li><a href="#orgeb6ebcf">3.3. Discussion</a></li>
</ul>
</li>
<li><a href="#org5856944">4. Delaying Decisions </a>
<ul>
<li><a href="#org737ac13">4.1. Goal</a></li>
<li><a href="#org1437f2e">4.2. Outline</a></li>
<li><a href="#orge600ae1">4.3. Discussion</a></li>
</ul>
</li>
<li><a href="#orgf1c4d69">5. Building Blocks </a>
<ul>
<li><a href="#orge334ca6">5.1. On-disk HDF5 file creation </a></li>
<li><a href="#org368893a">5.2. In-memory HDF5 file creation </a></li>
<li><a href="#org5dc404e">5.3. Dataset creation </a></li>
<li><a href="#org734c661">5.4. Print library and file info</a></li>
<li><a href="#orgbe35d3c">5.5. Big dataset creation </a></li>
<li><a href="#orge326dd2">5.6. Dataset size </a></li>
<li><a href="#org35417b7">5.7. Compact replica </a></li>
<li><a href="#orge16b956">5.8. Data transfer </a></li>
</ul>
</li>
<li><a href="#org0812f2a">6. Appendix</a>
<ul>
<li><a href="#orgf71a32e">6.1. Versions</a></li>
<li><a href="#orgc6a721b">6.2. Boilerplate with a twist</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga462c9c" class="outline-2">
<h2 id="orga462c9c"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Logically, an HDF5 file stored in a file system is just a sequence of bytes
formatted according to the HDF5 file format specification. Several factors
affect the performance with which such a sequence can be manipulated,
including (but not limited to) the latency and throughput of the underlying
storage hardware. <i>Memory-backed HDF5 files</i> eliminate this constraint by
maintaining the underlying byte sequence in contiguous RAM buffers.
</p>

<p>
The life-cycle of memory-backed HDF5 files is very simple:
</p>

<ol class="org-ol">
<li>Instruct the HDF5 library to create an HDF5 file in memory rather than in
a file system. (It is also possible to load existing HDF5 files into
memory buffers.)</li>
<li>For the lifetime of the application perform HDF5 I/O operations as usual.</li>
<li><p>
Before application shutdown decide whether to abandon the RAM buffer or to
persist certain parts of it in an HDF5 file in a file system.
</p>

<p>
The obvious use case for in-memory HDF5 files is their use as <i>I/O buffers</i>,
for example, in applications with large numbers of small-size and
random-access I/O operations. A second, often overlooked, use case is the
ability to deal with a high degree of <i>uncertainty</i>, especially, in
application backends. The idea is that by maintaining a memory-backed
<i>shadow</i> HDF5 file for such highly uncertain candidates, the decision about
what to put into a persisted (in storage) HDF5 file can often be delayed,
resulting in faster access and smaller files.
</p>

<p>
The vehicle for implementing this behavior in the HDF5 library is the
<i>virtual file layer</i> (VFL), specifically, the so-called <i>core</i> virtual file
driver (VFD).  This is, however, not the place to learn about implementation
details. See ??? for that.
</p>

<p>
This document is organized as follows: First, we present three examples
(sections <a href="#orgf8ebb61">2</a>, <a href="#org90c9fa3">3</a>, <a href="#orgad08dda">4</a>) with
their code outlines and their actual behavior. In section
<a href="#org4c28916">5</a>, we show the implementation of their (common) building
blocks.
</p></li>
</ol>
</div>

<div id="outline-container-org115be38" class="outline-3">
<h3 id="org115be38"><span class="section-number-3">1.1</span> Caveat Emptor</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The examples in this document are developed by incremental refinement. They
are written in C in a style that we call <i>literate HDF5</i>. (See <a href="https://en.wikipedia.org/wiki/Literate_programming">Knuth1992</a>.)
Each example is first outlined with placeholders inserted for code blocks
developed later. That should make the program logic easy to follow, keep the
noise-level down, and limit code repetition.
</p>

<p>
This document (<a href="https://www.jstatsoft.org/article/view/v046i03">org file</a>) is the <i>primary</i> source for different artifacts
such as other document formats (HTML, PDF, etc.) <i>and</i> the actual source
code (<code>*.c</code> files). Any change of this document will propagate
automatically, making artifacts easy to maintain and to reproduce its
results.
</p>

<p>
This code is for illustration only. For example, no error detection or
handling was attempted, and attentive readers will easily identify several
corner cases that were not considered.
</p>
</div>
</div>

<div id="outline-container-org88588b4" class="outline-3">
<h3 id="org88588b4"><span class="section-number-3">1.2</span> Syntax</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The basic syntactic element to denote a code block with a deferred
implementation follows this pattern:
</p>

<pre class="example">
(*
  &lt;&lt;to-be-implemented&gt;&gt; ) (arg1, arg2, arg3, ...);
</pre>

<p>
The syntax resembles a C function pointer, where <code>&lt;&lt;to-be-implemented&gt;&gt;</code>
represents the code implementing the referenced function with arguments
<code>arg1, arg2, arg3</code>, etc. Readers familiar with <i>lambda functions</i> might find
it convenient to think about these blocks as such. (If the examples were
written in C++, that would be one way to go about it.)
</p>
</div>
</div>
