core-vfd-101/core-vfd.tex
% Created 2020-12-27 Sun 08:40
% Intended LaTeX compiler: xelatex
\documentclass[a4paper, 12pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,top=1cm,bottom=1cm,left=1cm,right=1cm]{geometry}
\author{Gerd Heber}
\date{17 December 2020}
\title{Using Memory-Backed HDF5 Files to Reduce Storage Access and Size}
\hypersetup{
 pdfauthor={Gerd Heber},
 pdftitle={Using Memory-Backed HDF5 Files to Reduce Storage Access and Size},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec:org2438f7c}

Logically, an HDF5 file stored in a file system is just a sequence of bytes
formatted according to the HDF5 file format specification. Several factors
affect the performance with which such a sequence can be manipulated,
including (but not limited to) the latency and throughput of the underlying
storage hardware. \emph{Memory-backed HDF5 files} eliminate this constraint by
maintaining the underlying byte sequence in contiguous RAM buffers.

The life-cycle of memory-backed HDF5 files is very simple:

\begin{enumerate}
\item Instruct the HDF5 library to create an HDF5 file in memory rather than in
a file system. (It is also possible to load existing HDF5 files into
memory buffers.)
\item For the lifetime of the application perform HDF5 I/O operations as usual.
\item Before application shutdown decide whether to abandon the RAM buffer or to
persist certain parts of it in an HDF5 file in a file system.
\end{enumerate}

The obvious use case for in-memory HDF5 files is their use as \emph{I/O buffers},
for example, in applications with large numbers of small-size and
random-access I/O operations. A second, often overlooked, use case is the
ability to deal with a high degree of \emph{uncertainty}, especially, in
application backends. The idea is that by maintaining a memory-backed
\emph{shadow} HDF5 file for such highly uncertain candidates, the decision about
what to put into a persisted (in storage) HDF5 file can often be delayed,
resulting in faster access and smaller files.

The vehicle for implementing this behavior in the HDF5 library is the
\emph{virtual file layer} (VFL), specifically, the so-called \emph{core} virtual file
driver (VFD).  This is, however, not the place to learn about implementation
details. See ??? for that.

This document is organized as follows: First, we present three examples
(sections \ref{orged3315b}, \ref{orga6e6d24}, \ref{orgca09e6b}) with
their code outlines and their actual behavior. In section
\ref{orga1e6e52}, we show the implementation of their (common) building
blocks.

\subsection{Caveat Emptor}
\label{sec:orgae5f3c1}

The examples in this document are developed by incremental refinement. They
are written in C in a style that we call \emph{literate HDF5}. (See \href{https://en.wikipedia.org/wiki/Literate\_programming}{Knuth1992}.)
Each example is first outlined with placeholders inserted for code blocks
developed later. That should make the program logic easy to follow, keep the
noise-level down, and limit code repetition.

This document (\href{https://www.jstatsoft.org/article/view/v046i03}{org file}) is the \emph{primary} source for different artifacts
such as other document formats (HTML, PDF, etc.) \emph{and} the actual source
code (\texttt{*.c} files). Any change of this document will propagate
automatically, making artifacts easy to maintain and to reproduce its
results.

This code is for illustration only. For example, no error detection or
handling was attempted, and attentive readers will easily identify several
corner cases that were not considered.

\subsection{Syntax}
\label{sec:org6c17268}

The basic syntactic element to denote a code block with a deferred
implementation follows this pattern:

\begin{verbatim}
(*
  <<to-be-implemented>> ) (arg1, arg2, arg3, ...);
\end{verbatim}

The syntax resembles a C function pointer, where \texttt{<<to-be-implemented>>}
represents the code implementing the referenced function with arguments
\texttt{arg1, arg2, arg3}, etc. Readers familiar with \emph{lambda functions} might find
it convenient to think about these blocks as such. (If the examples were
written in C++, that would be one way to go about it.)
