core-vfd-101/core-vfd.org
** Logistics

   There are several ways to run the examples contained in this document.

   1. [[https://www.gnu.org/software/emacs/][Emacs]] users can execute the code blocks containing =main= functions
      directly via =C-c C-c,= provided the HDF5 library is in their
      =LD_LIBRARY_PATH= and [[https://gcc.gnu.org/][GCC]] knows where to find the HDF5 header files and
      library. If the =h5cc= compiler wrapper is in your =PATH=, execute the
      following block:

      #+begin_src emacs-lisp :results silent

      (setq org-babel-C-compiler "h5cc --std=gnu99 ")

      #+end_src

      Otherwise, you have to be more specfic. For example:

      #+begin_src emacs-lisp :results silent

      (setq org-babel-C-compiler
            (concat "gcc --std=gnu99 "
                    "-I/home/gerdheber/.local/include "
                    "-L/home/gerdheber/.local/lib "))

      #+end_src

   2. The examples' source code can be obtained by "tangling" the org file via
      =C-c C-v t= from Emacs or from the command line by running

      #+begin_example

      emacs --batch --eval "(require 'org)" \
            --eval '(org-babel-tangle-file "core-vfd.org")'

      #+end_example

      The code can then be compiled with =gcc --std=gnu99 ...= and the
      appropriate include and library paths for HDF5.

* Basic Use  <<sec:basic-use>>

  The HDF5 library supports an in-memory, aka. in-/core/, representation of HDF5
  files, which should not to be confused with [[https://en.wikipedia.org/wiki/Memory-mapped_file][memory-mapped files]]. Unlike files
  in a file system, which are represented by inodes and ultimately blocks on a
  block device, memory-backed HDF5 files are just contiguous memory regions
  ("buffers") formatted according to the [[https://portal.hdfgroup.org/display/HDF5/File+Format+Specification][HDF5 file format specification]]. Since
  they /are/ HDF5 files, the API for such "files" is identical to the one for
  "regular" (=on-disk) HDF5 files.

  The purpose of the first example is to show that working with memory-backed
  HDF5 files is as straightforward as working with HDF5 files in a file system.

** Goal

   /We would like to write an array of integers to a 2D dataset in a
   memory-backed HDF5 file./

   Before we look at memory-backed HDF5 files, let's recap the steps for
   ordinary HDF5 files!

** Outline for an HDF5 file in a file system

   Given our important array =data=, we:
   1. Create an HDF5 file, =disk.h5=
   2. Create a suitably sized and typed dataset =/2x3=, and write =data=
   3. Close the dataset
   4. Close the file, after printing the HDF5 library version and the file size
      on-disk

   **Note:** The paragraph following the outline shows the actual program
   output.

   #+headers:  :libs -lhdf5 :exports both :results output
   #+begin_src C -r -n :tangle src/core-vfd0.c :noweb no-export

   <<boilerplate>> // (ref:vfd0-boiler)

   int main(int argc, char** argv)
   {
     int data[] = {0, 1, 2, 3, 4, 5};
     hid_t file = (*
                    <<make-disk-file>> ) ("disk.h5"); // (ref:vfd0-blk0)
     hid_t dset = (*
                    <<make-2D-dataset>> ) (file, "2x3", H5T_STD_I32LE, // (ref:vfd0-blk1)
                                           (hsize_t[]){2,3}, data);
     H5Dclose(dset);

     (*
       <<print-lib-version>> ) ();
     (*
       <<print-file-size>> ) (file);

     H5Fclose(file);

     return 0;
   }

   #+end_src

   #+RESULTS:
   : HDF5 library version 1.13.0
   : File size: 4096 bytes

   The =<<boilerplate>>= block on line [[(vfd0-boiler)]] has the usual =include=
   directives and is provided in the [[Boilerplate with a twist][appendix]].

   The =<<make-disk-file>>= block (line [[(vfd0-blk0)]]) is merely a call to
   =H5Fcreate= (see section [[sec:disk-file-creation]]) and the
   =<<make-2D-dataset>>= block (line [[(vfd0-blk1)]]) is a call to =H5Dcreate= with
   all the trimmings (see section [[sec:dataset-creation]]).

