core-vfd-101/core-vfd.html

<div id="outline-container-orga748cb1" class="outline-3">
<h3 id="orga748cb1"><span class="section-number-3">1.3</span> Logistics</h3>
<div class="outline-text-3" id="text-1-3">
<p>
There are several ways to run the examples contained in this document.
</p>

<ol class="org-ol">
<li><p>
<a href="https://www.gnu.org/software/emacs/">Emacs</a> users can execute the code blocks containing <code>main</code> functions
directly via <code>C-c C-c,</code> provided the HDF5 library is in their
<code>LD_LIBRARY_PATH</code> and <a href="https://gcc.gnu.org/">GCC</a> knows where to find the HDF5 header files and
library. If the <code>h5cc</code> compiler wrapper is in your <code>PATH</code>, execute the
following block:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #0000FF;">setq</span> org-babel-C-compiler <span style="color: #008000;">"h5cc --std=gnu99 "</span>)

</pre>
</div>

<p>
Otherwise, you have to be more specfic. For example:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #0000FF;">setq</span> org-babel-C-compiler
      (concat <span style="color: #008000;">"gcc --std=gnu99 "</span>
              <span style="color: #008000;">"-I/home/gerdheber/.local/include "</span>
              <span style="color: #008000;">"-L/home/gerdheber/.local/lib "</span>))

</pre>
</div></li>

<li><p>
The examples' source code can be obtained by "tangling" the org file via
<code>C-c C-v t</code> from Emacs or from the command line by running
</p>

<pre class="example">

emacs --batch --eval "(require 'org)" \
      --eval '(org-babel-tangle-file "core-vfd.org")'

</pre>

<p>
The code can then be compiled with <code>gcc --std=gnu99 ...</code> and the
appropriate include and library paths for HDF5.
</p></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org18f2cec" class="outline-2">
<h2 id="org18f2cec"><span class="section-number-2">2</span> Basic Use  <a id="orgf8ebb61"></a></h2>
<div class="outline-text-2" id="text-2">
<p>
The HDF5 library supports an in-memory, aka. in-<i>core</i>, representation of HDF5
files, which should not to be confused with <a href="https://en.wikipedia.org/wiki/Memory-mapped_file">memory-mapped files</a>. Unlike files
in a file system, which are represented by inodes and ultimately blocks on a
block device, memory-backed HDF5 files are just contiguous memory regions
("buffers") formatted according to the <a href="https://portal.hdfgroup.org/display/HDF5/File+Format+Specification">HDF5 file format specification</a>. Since
they <i>are</i> HDF5 files, the API for such "files" is identical to the one for
"regular" (=on-disk) HDF5 files.
</p>

<p>
The purpose of the first example is to show that working with memory-backed
HDF5 files is as straightforward as working with HDF5 files in a file system.
</p>
</div>

<div id="outline-container-org0d0dcf9" class="outline-3">
<h3 id="org0d0dcf9"><span class="section-number-3">2.1</span> Goal</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<i>We would like to write an array of integers to a 2D dataset in a
memory-backed HDF5 file.</i>
</p>

<p>
Before we look at memory-backed HDF5 files, let's recap the steps for
ordinary HDF5 files!
</p>
</div>
</div>

<div id="outline-container-orgb838191" class="outline-3">
<h3 id="orgb838191"><span class="section-number-3">2.2</span> Outline for an HDF5 file in a file system</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Given our important array <code>data</code>, we:
</p>
<ol class="org-ol">
<li>Create an HDF5 file, <code>disk.h5</code></li>
<li>Create a suitably sized and typed dataset <code>/2x3</code>, and write <code>data</code></li>
<li>Close the dataset</li>
<li><p>
Close the file, after printing the HDF5 library version and the file size
on-disk
</p>

<p>
<b><b>Note:</b></b> The paragraph following the outline shows the actual program
output.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span id="coderef-vfd0-boiler" class="coderef-off"><span class="linenr"> 2: </span>&lt;&lt;boilerplate&gt;&gt;</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #6434A3;">int</span> main(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span>** <span style="color: #BA36A5;">argv</span>)
<span class="linenr"> 5: </span>{
<span class="linenr"> 6: </span>  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">data</span>[] = {0, 1, 2, 3, 4, 5};
<span class="linenr"> 7: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file</span> = (*
<span id="coderef-vfd0-blk0" class="coderef-off"><span class="linenr"> 8: </span>                &lt;&lt;make-disk-file&gt;&gt; ) (<span style="color: #008000;">"disk.h5"</span>);</span>
<span class="linenr"> 9: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dset</span> = (*
<span id="coderef-vfd0-blk1" class="coderef-off"><span class="linenr">10: </span>                &lt;&lt;make-2D-dataset&gt;&gt; ) (file, <span style="color: #008000;">"2x3"</span>, H5T_STD_I32LE,</span>
<span class="linenr">11: </span>                                       (<span style="color: #6434A3;">hsize_t</span>[]){2,3}, data);
<span class="linenr">12: </span>  H5Dclose(dset);
<span class="linenr">13: </span>
<span class="linenr">14: </span>  (*
<span class="linenr">15: </span>   &lt;&lt;print-lib-version&gt;&gt; ) ();
<span class="linenr">16: </span>  (*
<span class="linenr">17: </span>   &lt;&lt;print-file-size&gt;&gt; ) (file);
<span class="linenr">18: </span>
<span class="linenr">19: </span>  H5Fclose(file);
<span class="linenr">20: </span>
<span class="linenr">21: </span>  <span style="color: #0000FF;">return</span> 0;
<span class="linenr">22: </span>}
<span class="linenr">23: </span>
</pre>
</div>

<pre class="example">
HDF5 library version 1.13.0
File size: 4096 bytes

</pre>

<p>
The <code>&lt;&lt;boilerplate&gt;&gt;</code> block on line <a href="#coderef-vfd0-boiler" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-vfd0-boiler');" onmouseout="CodeHighlightOff(this, 'coderef-vfd0-boiler');">1</a> has the usual <code>include</code>
directives and is provided in the <a href="#orgc6a721b">appendix</a>.
</p>

<p>
The <code>&lt;&lt;make-disk-file&gt;&gt;</code> block (line <a href="#coderef-vfd0-blk0" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-vfd0-blk0');" onmouseout="CodeHighlightOff(this, 'coderef-vfd0-blk0');">7</a>) is merely a call to
<code>H5Fcreate</code> (see section <a href="#orge21664a">5.1</a>) and the
<code>&lt;&lt;make-2D-dataset&gt;&gt;</code> block (line <a href="#coderef-vfd0-blk1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-vfd0-blk1');" onmouseout="CodeHighlightOff(this, 'coderef-vfd0-blk1');">9</a>) is a call to <code>H5Dcreate</code> with
all the trimmings (see section <a href="#org5f261c0">5.3</a>).
</p></li>
</ol>
</div>
</div>
