core-vfd-101/core-vfd.tex

\subsection{Logistics}
\label{sec:orge4caebf}

There are several ways to run the examples contained in this document.

\begin{enumerate}
\item \href{https://www.gnu.org/software/emacs/}{Emacs} users can execute the code blocks containing \texttt{main} functions
directly via \texttt{C-c C-c,} provided the HDF5 library is in their
\texttt{LD\_LIBRARY\_PATH} and \href{https://gcc.gnu.org/}{GCC} knows where to find the HDF5 header files and
library. If the \texttt{h5cc} compiler wrapper is in your \texttt{PATH}, execute the
following block:

\begin{verbatim}

(setq org-babel-C-compiler "h5cc --std=gnu99 ")

\end{verbatim}

Otherwise, you have to be more specfic. For example:

\begin{verbatim}

(setq org-babel-C-compiler
      (concat "gcc --std=gnu99 "
              "-I/home/gerdheber/.local/include "
              "-L/home/gerdheber/.local/lib "))

\end{verbatim}

\item The examples' source code can be obtained by "tangling" the org file via
\texttt{C-c C-v t} from Emacs or from the command line by running

\begin{verbatim}

emacs --batch --eval "(require 'org)" \
      --eval '(org-babel-tangle-file "core-vfd.org")'

\end{verbatim}

The code can then be compiled with \texttt{gcc -{}-std=gnu99 ...} and the
appropriate include and library paths for HDF5.
\end{enumerate}

\section{Basic Use  \label{orged3315b}}
\label{sec:orga642e79}

The HDF5 library supports an in-memory, aka. in-\emph{core}, representation of HDF5
files, which should not to be confused with \href{https://en.wikipedia.org/wiki/Memory-mapped\_file}{memory-mapped files}. Unlike files
in a file system, which are represented by inodes and ultimately blocks on a
block device, memory-backed HDF5 files are just contiguous memory regions
("buffers") formatted according to the \href{https://portal.hdfgroup.org/display/HDF5/File+Format+Specification}{HDF5 file format specification}. Since
they \emph{are} HDF5 files, the API for such "files" is identical to the one for
"regular" (=on-disk) HDF5 files.

The purpose of the first example is to show that working with memory-backed
HDF5 files is as straightforward as working with HDF5 files in a file system.

\subsection{Goal}
\label{sec:org2d56df6}

\emph{We would like to write an array of integers to a 2D dataset in a
memory-backed HDF5 file.}

Before we look at memory-backed HDF5 files, let's recap the steps for
ordinary HDF5 files!

\subsection{Outline for an HDF5 file in a file system}
\label{sec:org92fff9f}

Given our important array \texttt{data}, we:
\begin{enumerate}
\item Create an HDF5 file, \texttt{disk.h5}
\item Create a suitably sized and typed dataset \texttt{/2x3}, and write \texttt{data}
\item Close the dataset
\item Close the file, after printing the HDF5 library version and the file size
on-disk
\end{enumerate}

\textbf{\textbf{Note:}} The paragraph following the outline shows the actual program
output.

\begin{verbatim}
 1
 2  <<boilerplate>>
 3
 4  int main(int argc, char** argv)
 5  {
 6    int data[] = {0, 1, 2, 3, 4, 5};
 7    hid_t file = (*
 8                   <<make-disk-file>> ) ("disk.h5");
 9    hid_t dset = (*
10                   <<make-2D-dataset>> ) (file, "2x3", H5T_STD_I32LE,
11                                          (hsize_t[]){2,3}, data);
12    H5Dclose(dset);
13
14    (*
15      <<print-lib-version>> ) ();
16    (*
17      <<print-file-size>> ) (file);
18
19    H5Fclose(file);
20
21    return 0;
22  }
23
\end{verbatim}

\begin{verbatim}
HDF5 library version 1.13.0
File size: 4096 bytes
\end{verbatim}

The \texttt{<<boilerplate>>} block on line 1 has the usual \texttt{include}
directives and is provided in the \hyperref[sec:orgd07fd63]{appendix}.

The \texttt{<<make-disk-file>>} block (line 7) is merely a call to
\texttt{H5Fcreate} (see section \ref{orgba3acb2}) and the
\texttt{<<make-2D-dataset>>} block (line 9) is a call to \texttt{H5Dcreate} with
all the trimmings (see section \ref{org38d97dd}).
