core-vfd-101/core-vfd.org
** Outline for a memory-backed HDF5 file

   The outline for memory-backed HDF5 files is almost identical to on-disk
   files. The =<<make-mem-file>>= block on line [[(mem-file-creation)]] has two
   additional arguments (see section [[sec:mem-file-creation]]). The first is the
   increment (in bytes) by which the backing memory buffer will grow, should
   that be necessary. In this example, it's 1 MiB. The third parameter, a flag,
   controls if the memory-backed file is persisted in storage after closing.
   Any argument passed to the executable will be interpreted as =TRUE= and the
   file persisted. By default (no arguments), there won't be a =core.h5= file
   after running the program.

   #+headers:  :libs -lhdf5 :exports both :results output
   #+begin_src C -r -n :tangle src/core-vfd1.c :noweb no-export

   <<boilerplate>>

   int main(int argc, char** argv)
   {
     int data[] = {0, 1, 2, 3, 4, 5};
     hid_t file = (*
                    <<make-mem-file>> ) ("core.h5", 1024*1024, (argc > 1)); // (ref:mem-file-creation)
     hid_t dset = (*
                    <<make-2D-dataset>> ) (file, "2x3", H5T_STD_I32LE,
                                           (hsize_t[]){2,3}, data);
     H5Dclose(dset);

     (*
       <<print-lib-version>> ) ();
     (*
       <<print-file-size>> ) (file);

     H5Fclose(file);

     return 0;
   }

   #+end_src

   #+RESULTS:
   : HDF5 library version 1.13.0
   : File size: 1048576 bytes

   The only difference between the on-disk and the memory-backed version is
   line [[(mem-file-creation)]], which shows that

   1. We are dealing with HDF5 files after all.
   2. The switch to memory-backed HDF5 files requires only minor changes of
      existing applications.

   See section [[sec:mem-file-creation]] for the implementation of
   =<<make-mem-files>>=.

** Discussion

   When running the executable =core-vfd1= for the memory-backed HDF5 file, we
   are informed that, for HDF5 library version 1.13.0, the (in-memory) file has
   a size of 1,048,576 bytes (1 MiB). However, the dataset itself is only about
   24 bytes (=six times four bytes plus metadata). Since we told the core VFD
   to grow the file in 1 MiB increments that's the minimum allocation.

   Running the program with any argument will persist the memory-backed HDF5
   file as =core.h5=. Surprisingly, that file is only 2072 bytes (for HDF5
   1.13.0). The reason is that the HDF5 library truncates and eliminates any
   unused space in the memory-backed HDF5 file before closing it.

   **Bottom line:** Memory-backed HDF5 files are as easy to use as HDF5 files
   in file systems.

* Copying Objects <<sec:copying-objects>>

  We can copy HDF5 objects such as groups and datasets inside the same HDF5
  file or across HDF5 files. A common scenario is to use a memory-backed HDF5
  file as a scratch space (or RAM disk) and, before closing it, to store only a
  few selected objects of interest in an on-disk HDF5 file.

** Goal

   /We would like to copy a dataset from a memory-backed HDF5 file to an HDF5
   file stored in a file system./

