core-vfd-101/core-vfd.html

<div id="outline-container-org6229835" class="outline-3">
<h3 id="org6229835"><span class="section-number-3">2.3</span> Outline for a memory-backed HDF5 file</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The outline for memory-backed HDF5 files is almost identical to on-disk
files. The <code>&lt;&lt;make-mem-file&gt;&gt;</code> block on line <a href="#coderef-mem-file-creation" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-mem-file-creation');" onmouseout="CodeHighlightOff(this, 'coderef-mem-file-creation');">7</a> has two
additional arguments (see section <a href="#orgf410aa7">5.2</a>). The first is the
increment (in bytes) by which the backing memory buffer will grow, should
that be necessary. In this example, it's 1 MiB. The third parameter, a flag,
controls if the memory-backed file is persisted in storage after closing.
Any argument passed to the executable will be interpreted as <code>TRUE</code> and the
file persisted. By default (no arguments), there won't be a <code>core.h5</code> file
after running the program.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>&lt;&lt;boilerplate&gt;&gt;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #6434A3;">int</span> main(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span>** <span style="color: #BA36A5;">argv</span>)
<span class="linenr"> 5: </span>{
<span class="linenr"> 6: </span>  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">data</span>[] = {0, 1, 2, 3, 4, 5};
<span class="linenr"> 7: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file</span> = (*
<span id="coderef-mem-file-creation" class="coderef-off"><span class="linenr"> 8: </span>                &lt;&lt;make-mem-file&gt;&gt; ) (<span style="color: #008000;">"core.h5"</span>, 1024*1024, (argc &gt; 1));</span>
<span class="linenr"> 9: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dset</span> = (*
<span class="linenr">10: </span>                &lt;&lt;make-2D-dataset&gt;&gt; ) (file, <span style="color: #008000;">"2x3"</span>, H5T_STD_I32LE,
<span class="linenr">11: </span>                                       (<span style="color: #6434A3;">hsize_t</span>[]){2,3}, data);
<span class="linenr">12: </span>  H5Dclose(dset);
<span class="linenr">13: </span>
<span class="linenr">14: </span>  (*
<span class="linenr">15: </span>   &lt;&lt;print-lib-version&gt;&gt; ) ();
<span class="linenr">16: </span>  (*
<span class="linenr">17: </span>   &lt;&lt;print-file-size&gt;&gt; ) (file);
<span class="linenr">18: </span>
<span class="linenr">19: </span>  H5Fclose(file);
<span class="linenr">20: </span>
<span class="linenr">21: </span>  <span style="color: #0000FF;">return</span> 0;
<span class="linenr">22: </span>}
<span class="linenr">23: </span>
</pre>
</div>

<pre class="example">
HDF5 library version 1.13.0
File size: 1048576 bytes

</pre>

<p>
The only difference between the on-disk and the memory-backed version is
line <a href="#coderef-mem-file-creation" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-mem-file-creation');" onmouseout="CodeHighlightOff(this, 'coderef-mem-file-creation');">7</a>, which shows that
</p>

<ol class="org-ol">
<li>We are dealing with HDF5 files after all.</li>
<li><p>
The switch to memory-backed HDF5 files requires only minor changes of
existing applications.
</p>

<p>
See section <a href="#orgf410aa7">5.2</a> for the implementation of
<code>&lt;&lt;make-mem-files&gt;&gt;</code>.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgb35dc7e" class="outline-3">
<h3 id="orgb35dc7e"><span class="section-number-3">2.4</span> Discussion</h3>
<div class="outline-text-3" id="text-2-4">
<p>
When running the executable <code>core-vfd1</code> for the memory-backed HDF5 file, we
are informed that, for HDF5 library version 1.13.0, the (in-memory) file has
a size of 1,048,576 bytes (1 MiB). However, the dataset itself is only about
24 bytes (=six times four bytes plus metadata). Since we told the core VFD
to grow the file in 1 MiB increments that's the minimum allocation.
</p>

<p>
Running the program with any argument will persist the memory-backed HDF5
file as <code>core.h5</code>. Surprisingly, that file is only 2072 bytes (for HDF5
1.13.0). The reason is that the HDF5 library truncates and eliminates any
unused space in the memory-backed HDF5 file before closing it.
</p>

<p>
<b><b>Bottom line:</b></b> Memory-backed HDF5 files are as easy to use as HDF5 files
in file systems.
</p>
</div>
</div>
</div>

<div id="outline-container-org5f0d7dc" class="outline-2">
<h2 id="org5f0d7dc"><span class="section-number-2">3</span> Copying Objects <a id="org90c9fa3"></a></h2>
<div class="outline-text-2" id="text-3">
<p>
We can copy HDF5 objects such as groups and datasets inside the same HDF5 file
or across HDF5 files. A common scenario is to use a memory-backed HDF5 file as
a scratch space (or RAM disk) and, before closing it, to store only a few
selected objects of interest in an on-disk HDF5 file.
</p>
</div>

<div id="outline-container-org79c16b5" class="outline-3">
<h3 id="org79c16b5"><span class="section-number-3">3.1</span> Goal</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<i>We would like to copy a dataset from a memory-backed HDF5 file to an HDF5 file
stored in a file system.</i>
</p>
</div>
</div>
