core-vfd-101/core-vfd.tex

\subsection{Outline for a memory-backed HDF5 file}
\label{sec:org902b199}

The outline for memory-backed HDF5 files is almost identical to on-disk
files. The \texttt{<<make-mem-file>>} block on line 7 has two
additional arguments (see section \ref{org6650a61}). The first is the
increment (in bytes) by which the backing memory buffer will grow, should
that be necessary. In this example, it's 1 MiB. The third parameter, a flag,
controls if the memory-backed file is persisted in storage after closing.
Any argument passed to the executable will be interpreted as \texttt{TRUE} and the
file persisted. By default (no arguments), there won't be a \texttt{core.h5} file
after running the program.

\begin{verbatim}
 1
 2  <<boilerplate>>
 3
 4  int main(int argc, char** argv)
 5  {
 6    int data[] = {0, 1, 2, 3, 4, 5};
 7    hid_t file = (*
 8                   <<make-mem-file>> ) ("core.h5", 1024*1024, (argc > 1));
 9    hid_t dset = (*
10                   <<make-2D-dataset>> ) (file, "2x3", H5T_STD_I32LE,
11                                          (hsize_t[]){2,3}, data);
12    H5Dclose(dset);
13
14    (*
15      <<print-lib-version>> ) ();
16    (*
17      <<print-file-size>> ) (file);
18
19    H5Fclose(file);
20
21    return 0;
22  }
23
\end{verbatim}

\begin{verbatim}
HDF5 library version 1.13.0
File size: 1048576 bytes
\end{verbatim}

The only difference between the on-disk and the memory-backed version is
line 7, which shows that

\begin{enumerate}
\item We are dealing with HDF5 files after all.
\item The switch to memory-backed HDF5 files requires only minor changes of
existing applications.
\end{enumerate}

See section \ref{org6650a61} for the implementation of
\texttt{<<make-mem-files>>}.

\subsection{Discussion}
\label{sec:org972d7e2}

When running the executable \texttt{core-vfd1} for the memory-backed HDF5 file, we
are informed that, for HDF5 library version 1.13.0, the (in-memory) file has
a size of 1,048,576 bytes (1 MiB). However, the dataset itself is only about
24 bytes (=six times four bytes plus metadata). Since we told the core VFD
to grow the file in 1 MiB increments that's the minimum allocation.

Running the program with any argument will persist the memory-backed HDF5
file as \texttt{core.h5}. Surprisingly, that file is only 2072 bytes (for HDF5
1.13.0). The reason is that the HDF5 library truncates and eliminates any
unused space in the memory-backed HDF5 file before closing it.

\textbf{\textbf{Bottom line:}} Memory-backed HDF5 files are as easy to use as HDF5 files
in file systems.

\section{Copying Objects \label{orga6e6d24}}
\label{sec:org3e7daa7}

We can copy HDF5 objects such as groups and datasets inside the same HDF5
file or across HDF5 files. A common scenario is to use a memory-backed HDF5
file as a scratch space (or RAM disk) and, before closing it, to store only a
few selected objects of interest in an on-disk HDF5 file.

\subsection{Goal}
\label{sec:orgd57ac4f}

\emph{We would like to copy a dataset from a memory-backed HDF5 file to an HDF5
file stored in a file system.}
