core-vfd-101/core-vfd.org
** Outline

   In this example, we are working with two HDF5 files, one memory-backed and
   the other in a file system. We re-use the file creation building blocks
   (lines [[(copy-file1)]], [[(copy-file2)]]) and the dataset creation building block
   (line [[(copy-mdset)]]) to create a dataset =dset_m= in the memory-backed HDF5
   file =file_m=. Fortunately, the HDF5 library provides a function, =H5Ocopy=,
   for copying HDF5 objects between HDF5 files. All we have to do is call it on
   line [[(copy-call)]].

   #+headers:  :libs -lhdf5 :exports both :results output
   #+begin_src C -r -n :tangle src/core-vfd2.c :noweb no-export

   <<boilerplate>>

   int main(int argc, char** argv)
   {
     int data[] = {0, 1, 2, 3, 4, 5};

     hid_t file_d = (*
                      <<make-disk-file>> ) ("disk.h5"); // (ref:copy-file1)
     hid_t file_m = (*
                      <<make-mem-file>> ) ("core.h5", 4096, (argc > 1)); // (ref:copy-file2)
     hid_t dset_m = (*
                      <<make-2D-dataset>> ) (file_m, "2x3", H5T_STD_I32LE, // (ref:copy-mdset)
                                             (hsize_t[]){2,3}, data);
     H5Dclose(dset_m);

     (*
       <<print-lib-version>> ) ();
     (*
       <<print-file-size>> ) (file_m);

     H5Ocopy(file_m, "2x3", file_d, "2x3copy", H5P_DEFAULT, H5P_DEFAULT); // (ref:copy-call)

     H5Fclose(file_m);

     (*
       <<print-file-size>> ) (file_d);

     H5Fclose(file_d);

     return 0;
   }

   #+end_src

   #+RESULTS:
   : HDF5 library version 1.13.0
   : File size: 4096 bytes
   : File size: 4096 bytes

** Discussion

   When running the program =core-vfd2=, we are informed that, for HDF5 library
   version 1.13.0, both files have a size of 4 KiB. That is a coincidence of
   two independent factors: Firstly, in line [[(copy-file2)]], we instructed the
   HDF5 library to grow the memory-backed HDF5 file in 4 KiB increments, and
   one increment is plenty to accommodate our small dataset. Secondly, the 4
   KiB size of the =disk.h5= file is due to paged allocation with 4 KiB being
   the default page size. (/Really?/)

   **Bottom line:** Transferring objects or parts of a hierarchy from a
   memory-backed HDF5 file to another HDF5 file, be it in a file system or
   another memory-backed file, is easy thanks to =H5Ocopy=!

* Delaying Decisions <<sec:delaying-decisions>>

  The developers and maintainers of certain application types, for example,
  data persistence back-ends of interactive applications, face specific
  challenges which stem from the /uncertainty/ over the particular course of
  action(s) their users take as part of a transaction or over the duration of a
  session. Ideally, any decisions that amount to commitments not easily undone
  later can be postponed or delayed until a better informed decision can be
  made.

  As stated earlier, when creating new objects, the HDF5 library needs certain
  information (e.g., creation properties) which stays with an object throughout
  its lifetime and which is immutable. The copy approach from the previous
  example won't work, because it preserves HDF5 objects' creation properties.
  Still, a memory-backed HDF5 "shadow" file can be used effectively alongside
  other HDF5 files as a holding area for objects whose final whereabouts are
  uncertain at object creation time.

** Goal

   /We would like to maintain a potentially very large 2D dataset in a
   memory-backed HDF5 file and eventually persist it to an HDF5 file in a file
   system./

