core-vfd-101/core-vfd.html

<div id="outline-container-orgd99aff6" class="outline-3">
<h3 id="orgd99aff6"><span class="section-number-3">3.2</span> Outline</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In this example, we are working with two HDF5 files, one memory-backed and the
other in a file system. We re-use the file creation building blocks (lines
<a href="#coderef-copy-file1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-copy-file1');" onmouseout="CodeHighlightOff(this, 'coderef-copy-file1');">8</a>, <a href="#coderef-copy-file2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-copy-file2');" onmouseout="CodeHighlightOff(this, 'coderef-copy-file2');">10</a>) and the dataset creation building block (line
<a href="#coderef-copy-mdset" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-copy-mdset');" onmouseout="CodeHighlightOff(this, 'coderef-copy-mdset');">12</a>) to create a dataset <code>dset_m</code> in the memory-backed HDF5 file
<code>file_m</code>. Fortunately, the HDF5 library provides a function, <code>H5Ocopy</code>, for
copying HDF5 objects between HDF5 files. All we have to do is call it on line
<a href="#coderef-copy-call" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-copy-call');" onmouseout="CodeHighlightOff(this, 'coderef-copy-call');">21</a>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>&lt;&lt;boilerplate&gt;&gt;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #6434A3;">int</span> main(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span>** <span style="color: #BA36A5;">argv</span>)
<span class="linenr"> 5: </span>{
<span class="linenr"> 6: </span>  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">data</span>[] = {0, 1, 2, 3, 4, 5};
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file_d</span> = (*
<span id="coderef-copy-file1" class="coderef-off"><span class="linenr"> 9: </span>                  &lt;&lt;make-disk-file&gt;&gt; ) (<span style="color: #008000;">"disk.h5"</span>);</span>
<span class="linenr">10: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file_m</span> = (*
<span id="coderef-copy-file2" class="coderef-off"><span class="linenr">11: </span>                  &lt;&lt;make-mem-file&gt;&gt; ) (<span style="color: #008000;">"core.h5"</span>, 4096, (argc &gt; 1));</span>
<span class="linenr">12: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dset_m</span> = (*
<span id="coderef-copy-mdset" class="coderef-off"><span class="linenr">13: </span>                  &lt;&lt;make-2D-dataset&gt;&gt; ) (file_m, <span style="color: #008000;">"2x3"</span>, H5T_STD_I32LE,</span>
<span class="linenr">14: </span>                                         (<span style="color: #6434A3;">hsize_t</span>[]){2,3}, data);
<span class="linenr">15: </span>  H5Dclose(dset_m);
<span class="linenr">16: </span>
<span class="linenr">17: </span>  (*
<span class="linenr">18: </span>   &lt;&lt;print-lib-version&gt;&gt; ) ();
<span class="linenr">19: </span>  (*
<span class="linenr">20: </span>   &lt;&lt;print-file-size&gt;&gt; ) (file_m);
<span class="linenr">21: </span>
<span id="coderef-copy-call" class="coderef-off"><span class="linenr">22: </span>  H5Ocopy(file_m, <span style="color: #008000;">"2x3"</span>, file_d, <span style="color: #008000;">"2x3copy"</span>, H5P_DEFAULT, H5P_DEFAULT);</span>
<span class="linenr">23: </span>
<span class="linenr">24: </span>  H5Fclose(file_m);
<span class="linenr">25: </span>
<span class="linenr">26: </span>  (*
<span class="linenr">27: </span>   &lt;&lt;print-file-size&gt;&gt; ) (file_d);
<span class="linenr">28: </span>
<span class="linenr">29: </span>  H5Fclose(file_d);
<span class="linenr">30: </span>
<span class="linenr">31: </span>  <span style="color: #0000FF;">return</span> 0;
<span class="linenr">32: </span>}
<span class="linenr">33: </span>
</pre>
</div>

<pre class="example">
HDF5 library version 1.13.0
File size: 4096 bytes
File size: 4096 bytes

</pre>
</div>
</div>

<div id="outline-container-orgeb6ebcf" class="outline-3">
<h3 id="orgeb6ebcf"><span class="section-number-3">3.3</span> Discussion</h3>
<div class="outline-text-3" id="text-3-3">
<p>
When running the program <code>core-vfd2</code>, we are informed that, for HDF5 library
version 1.13.0, both files have a size of 4 KiB. That is a coincidence of two
independent factors: Firstly, in line <a href="#coderef-copy-file2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-copy-file2');" onmouseout="CodeHighlightOff(this, 'coderef-copy-file2');">10</a>, we instructed the HDF5
library to grow the memory-backed HDF5 file in 4 KiB increments, and one
increment is plenty to accommodate our small dataset. Secondly, the 4 KiB size
of the <code>disk.h5</code> file is due to paged allocation with 4 KiB being the default
page size. (<i>Really?</i>)
</p>

<p>
<b><b>Bottom line:</b></b> Transferring objects or parts of a hierarchy from a
memory-backed HDF5 file to another HDF5 file, be it in a file system or another
memory-backed file, is easy thanks to <code>H5Ocopy</code>!
</p>
</div>
</div>
</div>

<div id="outline-container-org5856944" class="outline-2">
<h2 id="org5856944"><span class="section-number-2">4</span> Delaying Decisions <a id="orgad08dda"></a></h2>
<div class="outline-text-2" id="text-4">
<p>
The developers and maintainers of certain application types, for example, data
persistence back-ends of interactive applications, face specific challenges
which stem from the <i>uncertainty</i> over the particular course of action(s) their
users take as part of a transaction or over the duration of a session. Ideally,
any decisions that amount to commitments not easily undone later can be
postponed or delayed until a better informed decision can be made.
</p>

<p>
As stated earlier, when creating new objects, the HDF5 library needs certain
information (e.g., creation properties) which stays with an object throughout
its lifetime and which is immutable. The copy approach from the previous
example won't work, because it preserves HDF5 objects' creation properties.
Still, a memory-backed HDF5 "shadow" file can be used effectively alongside
other HDF5 files as a holding area for objects whose final whereabouts are
uncertain at object creation time.
</p>
</div>

<div id="outline-container-org737ac13" class="outline-3">
<h3 id="org737ac13"><span class="section-number-3">4.1</span> Goal</h3>
<div class="outline-text-3" id="text-4-1">
<p>
/We would like to maintain a potentially very large 2D dataset in a
memory-backed HDF5 file and eventually persist it to an HDF5 file in a file
system./
</p>
</div>
</div>
