core-vfd-101/core-vfd.tex

\subsection{Outline}
\label{sec:org6e03278}

In this example, we are working with two HDF5 files, one memory-backed and
the other in a file system. We re-use the file creation building blocks
(lines 8, 10) and the dataset creation building block
(line 12) to create a dataset \texttt{dset\_m} in the memory-backed HDF5
file \texttt{file\_m}. Fortunately, the HDF5 library provides a function, \texttt{H5Ocopy},
for copying HDF5 objects between HDF5 files. All we have to do is call it on
line 21.

\begin{verbatim}
 1
 2  <<boilerplate>>
 3
 4  int main(int argc, char** argv)
 5  {
 6    int data[] = {0, 1, 2, 3, 4, 5};
 7
 8    hid_t file_d = (*
 9                     <<make-disk-file>> ) ("disk.h5");
10    hid_t file_m = (*
11                     <<make-mem-file>> ) ("core.h5", 4096, (argc > 1));
12    hid_t dset_m = (*
13                     <<make-2D-dataset>> ) (file_m, "2x3", H5T_STD_I32LE,
14                                            (hsize_t[]){2,3}, data);
15    H5Dclose(dset_m);
16
17    (*
18      <<print-lib-version>> ) ();
19    (*
20      <<print-file-size>> ) (file_m);
21
22    H5Ocopy(file_m, "2x3", file_d, "2x3copy", H5P_DEFAULT, H5P_DEFAULT);
23
24    H5Fclose(file_m);
25
26    (*
27      <<print-file-size>> ) (file_d);
28
29    H5Fclose(file_d);
30
31    return 0;
32  }
33
\end{verbatim}

\begin{verbatim}
HDF5 library version 1.13.0
File size: 4096 bytes
File size: 4096 bytes
\end{verbatim}

\subsection{Discussion}
\label{sec:org8875a7c}

When running the program \texttt{core-vfd2}, we are informed that, for HDF5 library
version 1.13.0, both files have a size of 4 KiB. That is a coincidence of
two independent factors: Firstly, in line 10, we instructed the
HDF5 library to grow the memory-backed HDF5 file in 4 KiB increments, and
one increment is plenty to accommodate our small dataset. Secondly, the 4
KiB size of the \texttt{disk.h5} file is due to paged allocation with 4 KiB being
the default page size. (\emph{Really?})

\textbf{\textbf{Bottom line:}} Transferring objects or parts of a hierarchy from a
memory-backed HDF5 file to another HDF5 file, be it in a file system or
another memory-backed file, is easy thanks to \texttt{H5Ocopy}!

\section{Delaying Decisions \label{orgca09e6b}}
\label{sec:orgc03bf5d}

The developers and maintainers of certain application types, for example,
data persistence back-ends of interactive applications, face specific
challenges which stem from the \emph{uncertainty} over the particular course of
action(s) their users take as part of a transaction or over the duration of a
session. Ideally, any decisions that amount to commitments not easily undone
later can be postponed or delayed until a better informed decision can be
made.

As stated earlier, when creating new objects, the HDF5 library needs certain
information (e.g., creation properties) which stays with an object throughout
its lifetime and which is immutable. The copy approach from the previous
example won't work, because it preserves HDF5 objects' creation properties.
Still, a memory-backed HDF5 "shadow" file can be used effectively alongside
other HDF5 files as a holding area for objects whose final whereabouts are
uncertain at object creation time.

\subsection{Goal}
\label{sec:org327831f}

\emph{We would like to maintain a potentially very large 2D dataset in a
memory-backed HDF5 file and eventually persist it to an HDF5 file in a file
system.}
