core-vfd-101/core-vfd.org
** Outline

   There are a few new snippets in this example. The =<<make-big-2D-dataset>>=
   block on line [[(big-dset)]] appears identical to =<<make-2D-dataset>>=, but the
   implementation in section [[sec:big-dataset-creation]] shows that we are dealing
   with a datset of potentially arbitrary extent, using chunked storage layout.

   Between lines [[(uncert1)]] and [[(uncert2)]], we mimic the uncertainty around its
   extent during an application's lifetime by growing and shrinking it using
   =H5Dset_extent=.

   On line [[(size-check)]], we check its size once more (see section
   [[sec:dataset-size]]). If the size doesn't exceed 60,000 bytes, we optimize its
   persisted representation by using the so-called compact storage layout (line
   [[(compact)]] and section [[sec:compact-replica]]). In this case we need to transfer
   the data manually (line [[(data-xfer)]] and section [[sec:dataset-xfer]]).
   Otherwise, we fall back onto =H5Ocopy= (line [[(big-copy)]]).

   #+headers:  :libs -lhdf5 :exports both :results output
   #+begin_src C -r -n :tangle src/core-vfd3.c :noweb no-export

   <<boilerplate>>

   int main(int argc, char** argv)
   {
     int data[] = {0, 1, 2, 3, 4, 5};
     hid_t file_d = (*
                      <<make-disk-file>> ) ("disk.h5");
     hid_t file_m = (*
                      <<make-mem-file>> ) ("core.h5", 1024*1024, (argc > 1));
     hid_t dset_m = (*
                      <<make-big-2D-dataset>> ) (file_m, "2x3", // (ref:big-dset)
                                                 H5T_NATIVE_INT32,
                                                 (hsize_t[]){2,3}, data);
     (*
       <<print-lib-version>> ) ();
     (*
       <<print-file-size>> ) (file_m);

     { /* UNCERTAINTY */
       H5Dset_extent(dset_m, (hsize_t[]){200,300}); // (ref:uncert1)

       H5Dset_extent(dset_m, (hsize_t[]){200000,300000});

       H5Dset_extent(dset_m, (hsize_t[]){2,3}); // (ref:uncert2)
     }

     if ((*
           <<dataset-size>>) (dset_m) < 60000) // (ref:size-check)
     {
        hid_t dset_d = (*
                         <<create-compact>> ) (dset_m, file_d, "2x3copy"); // (ref:compact)
        (*
          <<xfer-data>> ) (dset_m, dset_d); // (ref:data-xfer)

        H5Dclose(dset_d);
     }
     else
     {
       H5Ocopy(file_m, "2x3", file_d, "2x3copy", H5P_DEFAULT, H5P_DEFAULT); // (ref:big-copy)
     }

     H5Dclose(dset_m);
     H5Fclose(file_m);

     (*
       <<print-file-size>> ) (file_d);

     H5Fclose(file_d);

     return 0;
   }

   #+end_src

   #+RESULTS:
   : HDF5 library version 1.13.0
   : File size: 5242880 bytes
   : File size: 2048 bytes

** Discussion

   When running the program =core-vfd3=, we are informed that, for HDF5 library
   version 1.13.0, the memory-backed HDF5 file has a size of over 4 MiB while
   the persisted file is just 2 KiB.

   As can be seen in section [[sec:big-dataset-creation]], the chunk size chosen
   for the =/2x3= dataset is 4 MiB. Although we are writing only six 32-bit
   integer (24 bytes), a full 4 MiB chunk needs to be allocated, which explains
   the overall size for the memory-backed HDF5 file.

   The compact storage layout is particularly storage- and access-efficient:
   the dataset elements are stored as part of the dataset's object header
   (metadata). This header is read whenever the dataset is opened, and the
   dataset elements "travel along for free", which means that there is no
   separate storage access necessary for subsequent read or write operations.

   **Bottom line:** The use of memory-backed HDF5 files can lead to substantial
   storage and access performance improvements, if applications "keep their
   cool" and do not prematurely commit storage resources to HDF5 objects.

* Building Blocks <<sec:building-blocks>>

