core-vfd-101/core-vfd.html

<div id="outline-container-org1437f2e" class="outline-3">
<h3 id="org1437f2e"><span class="section-number-3">4.2</span> Outline</h3>
<div class="outline-text-3" id="text-4-2">
<p>
There are a few new snippets in this example. The <code>&lt;&lt;make-big-2D-dataset&gt;&gt;</code>
block on line <a href="#coderef-big-dset" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-big-dset');" onmouseout="CodeHighlightOff(this, 'coderef-big-dset');">11</a> appears identical to <code>&lt;&lt;make-2D-dataset&gt;&gt;</code>, but the
implementation in section <a href="#org69e19b8">5.5</a> shows that we are dealing
with a datset of potentially arbitrary extent, using chunked storage layout.
</p>

<p>
Between lines <a href="#coderef-uncert1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-uncert1');" onmouseout="CodeHighlightOff(this, 'coderef-uncert1');">20</a> and <a href="#coderef-uncert2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-uncert2');" onmouseout="CodeHighlightOff(this, 'coderef-uncert2');">24</a>, we mimic the uncertainty around its
extent during an application's lifetime by growing and shrinking it using
<code>H5Dset_extent</code>.
</p>

<p>
On line <a href="#coderef-size-check" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-size-check');" onmouseout="CodeHighlightOff(this, 'coderef-size-check');">28</a>, we check its size once more (see section
<a href="#org86a33db">5.6</a>). If the size doesn't exceed 60,000 bytes, we optimize its
persisted representation by using the so-called compact storage layout (line
<a href="#coderef-compact" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compact');" onmouseout="CodeHighlightOff(this, 'coderef-compact');">31</a> and section <a href="#orgb46619a">5.7</a>). In this case we need to transfer
the data manually (line <a href="#coderef-data-xfer" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-data-xfer');" onmouseout="CodeHighlightOff(this, 'coderef-data-xfer');">33</a> and section <a href="#org07a75fe">5.8</a>).  Otherwise,
we fall back onto <code>H5Ocopy</code> (line <a href="#coderef-big-copy" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-big-copy');" onmouseout="CodeHighlightOff(this, 'coderef-big-copy');">39</a>).
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>&lt;&lt;boilerplate&gt;&gt;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #6434A3;">int</span> main(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span>** <span style="color: #BA36A5;">argv</span>)
<span class="linenr"> 5: </span>{
<span class="linenr"> 6: </span>  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">data</span>[] = {0, 1, 2, 3, 4, 5};
<span class="linenr"> 7: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file_d</span> = (*
<span class="linenr"> 8: </span>                  &lt;&lt;make-disk-file&gt;&gt; ) (<span style="color: #008000;">"disk.h5"</span>);
<span class="linenr"> 9: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file_m</span> = (*
<span class="linenr">10: </span>                  &lt;&lt;make-mem-file&gt;&gt; ) (<span style="color: #008000;">"core.h5"</span>, 1024*1024, (argc &gt; 1));
<span class="linenr">11: </span>  <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dset_m</span> = (*
<span id="coderef-big-dset" class="coderef-off"><span class="linenr">12: </span>                  &lt;&lt;make-big-2D-dataset&gt;&gt; ) (file_m, <span style="color: #008000;">"2x3"</span>,</span>
<span class="linenr">13: </span>                                             H5T_NATIVE_INT32,
<span class="linenr">14: </span>                                             (<span style="color: #6434A3;">hsize_t</span>[]){2,3}, data);
<span class="linenr">15: </span>  (*
<span class="linenr">16: </span>   &lt;&lt;print-lib-version&gt;&gt; ) ();
<span class="linenr">17: </span>  (*
<span class="linenr">18: </span>   &lt;&lt;print-file-size&gt;&gt; ) (file_m);
<span class="linenr">19: </span>
<span class="linenr">20: </span>  { <span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">UNCERTAINTY </span><span style="color: #8D8D84;">*/</span>
<span id="coderef-uncert1" class="coderef-off"><span class="linenr">21: </span>    H5Dset_extent(dset_m, (<span style="color: #6434A3;">hsize_t</span>[]){200,300});</span>
<span class="linenr">22: </span>
<span class="linenr">23: </span>    H5Dset_extent(dset_m, (<span style="color: #6434A3;">hsize_t</span>[]){200000,300000});
<span class="linenr">24: </span>
<span id="coderef-uncert2" class="coderef-off"><span class="linenr">25: </span>    H5Dset_extent(dset_m, (<span style="color: #6434A3;">hsize_t</span>[]){2,3});</span>
<span class="linenr">26: </span>  }
<span class="linenr">27: </span>
<span class="linenr">28: </span>  <span style="color: #0000FF;">if</span> ((*
<span id="coderef-size-check" class="coderef-off"><span class="linenr">29: </span>       &lt;&lt;dataset-size&gt;&gt;) (dset_m) &lt; 60000)</span>
<span class="linenr">30: </span>    {
<span class="linenr">31: </span>      <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dset_d</span> = (*
<span id="coderef-compact" class="coderef-off"><span class="linenr">32: </span>                      &lt;&lt;create-compact&gt;&gt; ) (dset_m, file_d, <span style="color: #008000;">"2x3copy"</span>);</span>
<span class="linenr">33: </span>      (*
<span id="coderef-data-xfer" class="coderef-off"><span class="linenr">34: </span>       &lt;&lt;xfer-data&gt;&gt; ) (dset_m, dset_d);</span>
<span class="linenr">35: </span>
<span class="linenr">36: </span>      H5Dclose(dset_d);
<span class="linenr">37: </span>    }
<span class="linenr">38: </span>  <span style="color: #0000FF;">else</span>
<span class="linenr">39: </span>    {
<span id="coderef-big-copy" class="coderef-off"><span class="linenr">40: </span>      H5Ocopy(file_m, <span style="color: #008000;">"2x3"</span>, file_d, <span style="color: #008000;">"2x3copy"</span>, H5P_DEFAULT, H5P_DEFAULT);</span>
<span class="linenr">41: </span>    }
<span class="linenr">42: </span>
<span class="linenr">43: </span>  H5Dclose(dset_m);
<span class="linenr">44: </span>  H5Fclose(file_m);
<span class="linenr">45: </span>
<span class="linenr">46: </span>  (*
<span class="linenr">47: </span>   &lt;&lt;print-file-size&gt;&gt; ) (file_d);
<span class="linenr">48: </span>
<span class="linenr">49: </span>  H5Fclose(file_d);
<span class="linenr">50: </span>
<span class="linenr">51: </span>  <span style="color: #0000FF;">return</span> 0;
<span class="linenr">52: </span>}
<span class="linenr">53: </span>
</pre>
</div>

<pre class="example">
HDF5 library version 1.13.0
File size: 5242880 bytes
File size: 2048 bytes

</pre>
</div>
</div>

<div id="outline-container-orge600ae1" class="outline-3">
<h3 id="orge600ae1"><span class="section-number-3">4.3</span> Discussion</h3>
<div class="outline-text-3" id="text-4-3">
<p>
When running the program <code>core-vfd3</code>, we are informed that, for HDF5 library
version 1.13.0, the memory-backed HDF5 file has a size of over 4 MiB while the
persisted file is just 2 KiB.
</p>

<p>
As can be seen in section <a href="#org69e19b8">5.5</a>, the chunk size chosen for
the <code>/2x3</code> dataset is 4 MiB. Although we are writing only six 32-bit integer
(24 bytes), a full 4 MiB chunk needs to be allocated, which explains the
overall size for the memory-backed HDF5 file.
</p>

<p>
The compact storage layout is particularly storage- and access-efficient: the
dataset elements are stored as part of the dataset's object header
(metadata). This header is read whenever the dataset is opened, and the dataset
elements "travel along for free", which means that there is no separate storage
access necessary for subsequent read or write operations.
</p>

<p>
<b><b>Bottom line:</b></b> The use of memory-backed HDF5 files can lead to substantial
storage and access performance improvements, if applications "keep their cool"
and do not prematurely commit storage resources to HDF5 objects.
</p>
</div>
</div>
</div>
