core-vfd-101/core-vfd.org
** On-disk HDF5 file creation <<sec:disk-file-creation>>

   =H5Fcreate= has four parameters, of which the first two, file name and access
   flag, are usally in the limelight. To create an on-disk HDF5 file is as easy
   as this:

   #+begin_src C :noweb-ref make-disk-file

   lambda(hid_t, (const char* name),
     {
       return H5Fcreate(name, H5F_ACC_TRUNC, H5P_DEFAULT, H5P_DEFAULT);
     })

   #+end_src

   The third and the fourth parameter, a /file creation/ and a /file access/
   property list (handle), unlock a few extra treats, as we will see in a
   moment.

** In-memory HDF5 file creation <<sec:mem-file-creation>>

   We use the fourth parameter of =H5Fcreate=, a file access property list, to do
   the in-memory magic.

   #+begin_src C -r -n :noweb-ref make-mem-file

   lambda(hid_t, (const char* name, size_t increment, hbool_t flg),
     {
       hid_t retval;
       hid_t fapl = H5Pcreate(H5P_FILE_ACCESS);

       H5Pset_fapl_core(fapl, increment, flg); // (ref:fapl-core)

       retval = H5Fcreate(name, H5F_ACC_TRUNC, H5P_DEFAULT, fapl);
       H5Pclose(fapl);
       return retval;
     })

   #+end_src

   That's right, a suitably initialized property list (line [[(fapl-core)]]) makes
   all the difference. This is in fact the ONLY difference between an
   application using regular vs. memory-backed HDF5 files.

** Dataset creation <<sec:dataset-creation>>

   To create a dataset, we must specify a =name=, its element type =dtype=, its
   shape =dims=, and, optionally, an inital value =buffer=. Without additional
   customization, the default dataset storage layout is =H5D_CONTIGUOUS=, i.e.,
   the (fixed-size) dataset elements are layed out in a contigous (memory
   or storage) region.

   #+begin_src C -r -n :noweb-ref make-2D-dataset

   lambda(hid_t,
          (hid_t file, const char* name, hid_t dtype, const hsize_t* dims, void* buffer),
     {
       hid_t retval;
       hid_t dspace = H5Screate_simple(2, dims, NULL);

       retval = H5Dcreate(file, name, dtype, dspace, // (ref:dset-dtype1)
                          H5P_DEFAULT, H5P_DEFAULT, H5P_DEFAULT);

       if (buffer)
         H5Dwrite(retval, dtype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer); // (ref:dset-dtype2)

       H5Sclose(dspace);
       return retval;
     })

   #+end_src

   **WARNING:** This snippet contains an /important assumption/ that may not be
   obvious to many readers: The datatype handle =dtype= is used in two places
   with different interpretations. In the first instance, line [[(dset-dtype1)]],
   it refers to the in-file element type of the dataset to be created. In the
   second instance, line [[(dset-dtype2)]], it refers to the datatype of the
   elements in =buffer=. The assumption is that the two are the same. While this
   assumption is valid in many practical examples, it can lead to subtle errors
   if its violation goes undetected. In a production code, this should be
   either documented and enforced, or an additional datatype argument be passed
   to distinguish them.

** Print library and file info

   #+begin_src C :noweb-ref print-lib-version

   lambda(void, (void),
     {
       unsigned majnum;
       unsigned minnum;
       unsigned relnum;
       H5get_libversion(&majnum, &minnum, &relnum);
       printf("HDF5 library version %d.%d.%d\n", majnum, minnum, relnum);
     })

   #+end_src

   #+begin_src C :noweb-ref print-file-size

   lambda(void, (hid_t file),
     {
       hsize_t size;
       H5Fget_filesize(file, &size);
       printf("File size: %ld bytes\n", size);
     })

   #+end_src

