core-vfd-101/core-vfd.html

<div id="outline-container-orgf1c4d69" class="outline-2">
<h2 id="orgf1c4d69"><span class="section-number-2">5</span> Building Blocks <a id="org4c28916"></a></h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orge334ca6" class="outline-3">
<h3 id="orge334ca6"><span class="section-number-3">5.1</span> On-disk HDF5 file creation <a id="orge21664a"></a></h3>
<div class="outline-text-3" id="text-5-1">
<p>
<code>H5Fcreate</code> has four parameters, of which the first two, file name and access
flag, are usally in the limelight. To create an on-disk HDF5 file is as easy as
this:
</p>

<div class="org-src-container">
<pre class="src src-C">
<span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">hid_t</span>, (<span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">name</span>),
       {
         <span style="color: #0000FF;">return</span> H5Fcreate(name, H5F_ACC_TRUNC, H5P_DEFAULT, H5P_DEFAULT);
       })

</pre>
</div>

<p>
The third and the fourth parameter, a <i>file creation</i> and a <i>file access</i>
property list (handle), unlock a few extra treats, as we will see in a moment.
</p>
</div>
</div>

<div id="outline-container-org368893a" class="outline-3">
<h3 id="org368893a"><span class="section-number-3">5.2</span> In-memory HDF5 file creation <a id="orgf410aa7"></a></h3>
<div class="outline-text-3" id="text-5-2">
<p>
We use the fourth parameter of <code>H5Fcreate</code>, a file access property list, to do
the in-memory magic.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span><span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">hid_t</span>, (<span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">name</span>, <span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">increment</span>, <span style="color: #6434A3;">hbool_t</span> <span style="color: #BA36A5;">flg</span>),
<span class="linenr"> 3: </span>       {
<span class="linenr"> 4: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">retval</span>;
<span class="linenr"> 5: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">fapl</span> = H5Pcreate(H5P_FILE_ACCESS);
<span class="linenr"> 6: </span>
<span id="coderef-fapl-core" class="coderef-off"><span class="linenr"> 7: </span>         H5Pset_fapl_core(fapl, increment, flg);</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>         retval = H5Fcreate(name, H5F_ACC_TRUNC, H5P_DEFAULT, fapl);
<span class="linenr">10: </span>         H5Pclose(fapl);
<span class="linenr">11: </span>         <span style="color: #0000FF;">return</span> retval;
<span class="linenr">12: </span>       })
<span class="linenr">13: </span>
</pre>
</div>

<p>
That's right, a suitably initialized property list (line <a href="#coderef-fapl-core" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-fapl-core');" onmouseout="CodeHighlightOff(this, 'coderef-fapl-core');">6</a>) makes all
the difference. This is in fact the ONLY difference between an application
using regular vs. memory-backed HDF5 files.
</p>
</div>
</div>

<div id="outline-container-org5dc404e" class="outline-3">
<h3 id="org5dc404e"><span class="section-number-3">5.3</span> Dataset creation <a id="org5f261c0"></a></h3>
<div class="outline-text-3" id="text-5-3">
<p>
To create a dataset, we must specify a <code>name</code>, its element type <code>dtype</code>, its
shape <code>dims</code>, and, optionally, an inital value <code>buffer</code>. Without additional
customization, the default dataset storage layout is <code>H5D_CONTIGUOUS</code>, i.e.,
the (fixed-size) dataset elements are layed out in a contigous (memory or
storage) region.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span><span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">hid_t</span>,
<span class="linenr"> 3: </span>       (<span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file</span>, <span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">name</span>, <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dtype</span>, <span style="color: #0000FF;">const</span> <span style="color: #6434A3;">hsize_t</span>* <span style="color: #BA36A5;">dims</span>, <span style="color: #6434A3;">void</span>* <span style="color: #BA36A5;">b</span><span style="color: #BA36A5; background-color: #ff0000;">u</span><span style="color: #BA36A5;">ffer</span>),
<span class="linenr"> 4: </span>       {
<span class="linenr"> 5: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">retval</span>;
<span class="linenr"> 6: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dspace</span> = H5Screate_simple(2, dims, <span style="color: #D0372D;">NULL</span>);
<span class="linenr"> 7: </span>
<span id="coderef-dset-dtype1" class="coderef-off"><span class="linenr"> 8: </span>         retval = H5Dcreate(file, name, dtype, dspace,</span>
<span class="linenr"> 9: </span>                            H5P_DEFAULT, H5P_DEFAULT, H5P_DEFAULT);
<span class="linenr">10: </span>
<span class="linenr">11: </span>         <span style="color: #0000FF;">if</span> (buffer)
<span id="coderef-dset-dtype2" class="coderef-off"><span class="linenr">12: </span>           H5Dwrite(retval, dtype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer);</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span>         H5Sclose(dspace);
<span class="linenr">15: </span>         <span style="color: #0000FF;">return</span> retval;
<span class="linenr">16: </span>       })
<span class="linenr">17: </span>
</pre>
</div>

<p>
<b><b>WARNING:</b></b> This snippet contains an <i>important assumption</i> that may not be
obvious to many readers: The datatype handle <code>dtype</code> is used in two places with
different interpretations. In the first instance, line <a href="#coderef-dset-dtype1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-dset-dtype1');" onmouseout="CodeHighlightOff(this, 'coderef-dset-dtype1');">7</a>, it refers
to the in-file element type of the dataset to be created. In the second
instance, line <a href="#coderef-dset-dtype2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-dset-dtype2');" onmouseout="CodeHighlightOff(this, 'coderef-dset-dtype2');">11</a>, it refers to the datatype of the elements in
<code>buffer</code>. The assumption is that the two are the same. While this assumption is
valid in many practical examples, it can lead to subtle errors if its violation
goes undetected. In a production code, this should be either documented and
enforced, or an additional datatype argument be passed to distinguish them.
</p>
</div>
</div>

<div id="outline-container-org734c661" class="outline-3">
<h3 id="org734c661"><span class="section-number-3">5.4</span> Print library and file info</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-C">
<span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">void</span>, (<span style="color: #6434A3;">void</span>),
       {
         <span style="color: #6434A3;">unsigned</span> <span style="color: #BA36A5;">majnum</span>;
         <span style="color: #6434A3;">unsigned</span> <span style="color: #BA36A5;">minnum</span>;
         <span style="color: #6434A3;">unsigned</span> <span style="color: #BA36A5;">relnum</span>;
         H5get_libversion(&amp;majnum, &amp;minnum, &amp;relnum);
         printf(<span style="color: #008000;">"HDF5 library version %d.%d.%d\n"</span>, majnum, minnum, relnum);
       })

</pre>
</div>

<div class="org-src-container">
<pre class="src src-C">
<span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">void</span>, (<span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file</span>),
       {
         <span style="color: #6434A3;">hsize_t</span> <span style="color: #BA36A5;">size</span>;
         H5Fget_filesize(file, &amp;size);
         printf(<span style="color: #008000;">"File size: %ld bytes\n"</span>, size);
       })

</pre>
</div>
</div>
</div>
