core-vfd-101/core-vfd.tex

\section{Building Blocks \label{orga1e6e52}}
\label{sec:orgdd09289}

\subsection{On-disk HDF5 file creation \label{orgba3acb2}}
\label{sec:orgd389401}

\texttt{H5Fcreate} has four parameters, of which the first two, file name and access
flag, are usally in the limelight. To create an on-disk HDF5 file is as easy
as this:

\begin{verbatim}

lambda(hid_t, (const char* name),
  {
    return H5Fcreate(name, H5F_ACC_TRUNC, H5P_DEFAULT, H5P_DEFAULT);
  })

\end{verbatim}

The third and the fourth parameter, a \emph{file creation} and a \emph{file access}
property list (handle), unlock a few extra treats, as we will see in a
moment.

\subsection{In-memory HDF5 file creation \label{org6650a61}}
\label{sec:orgf848da4}

We use the fourth parameter of \texttt{H5Fcreate}, a file access property list, to do
the in-memory magic.

\begin{verbatim}
 1
 2  lambda(hid_t, (const char* name, size_t increment, hbool_t flg),
 3    {
 4      hid_t retval;
 5      hid_t fapl = H5Pcreate(H5P_FILE_ACCESS);
 6
 7      H5Pset_fapl_core(fapl, increment, flg);
 8
 9      retval = H5Fcreate(name, H5F_ACC_TRUNC, H5P_DEFAULT, fapl);
10      H5Pclose(fapl);
11      return retval;
12    })
13
\end{verbatim}

That's right, a suitably initialized property list (line 6) makes
all the difference. This is in fact the ONLY difference between an
application using regular vs. memory-backed HDF5 files.

\subsection{Dataset creation \label{org38d97dd}}
\label{sec:orgc7b7d01}

To create a dataset, we must specify a \texttt{name}, its element type \texttt{dtype}, its
shape \texttt{dims}, and, optionally, an inital value \texttt{buffer}. Without additional
customization, the default dataset storage layout is \texttt{H5D\_CONTIGUOUS}, i.e.,
the (fixed-size) dataset elements are layed out in a contigous (memory
or storage) region.

\begin{verbatim}
 1
 2  lambda(hid_t,
 3         (hid_t file, const char* name, hid_t dtype, const hsize_t* dims, void* buffer),
 4    {
 5      hid_t retval;
 6      hid_t dspace = H5Screate_simple(2, dims, NULL);
 7
 8      retval = H5Dcreate(file, name, dtype, dspace,
 9                         H5P_DEFAULT, H5P_DEFAULT, H5P_DEFAULT);
10
11      if (buffer)
12        H5Dwrite(retval, dtype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer);
13
14      H5Sclose(dspace);
15      return retval;
16    })
17
\end{verbatim}

\textbf{\textbf{WARNING:}} This snippet contains an \emph{important assumption} that may not be
obvious to many readers: The datatype handle \texttt{dtype} is used in two places
with different interpretations. In the first instance, line 7,
it refers to the in-file element type of the dataset to be created. In the
second instance, line 11, it refers to the datatype of the
elements in \texttt{buffer}. The assumption is that the two are the same. While this
assumption is valid in many practical examples, it can lead to subtle errors
if its violation goes undetected. In a production code, this should be
either documented and enforced, or an additional datatype argument be passed
to distinguish them.

\subsection{Print library and file info}
\label{sec:org35ccb20}

\begin{verbatim}

lambda(void, (void),
  {
    unsigned majnum;
    unsigned minnum;
    unsigned relnum;
    H5get_libversion(&majnum, &minnum, &relnum);
    printf("HDF5 library version %d.%d.%d\n", majnum, minnum, relnum);
  })

\end{verbatim}

\begin{verbatim}

lambda(void, (hid_t file),
  {
    hsize_t size;
    H5Fget_filesize(file, &size);
    printf("File size: %ld bytes\n", size);
  })

\end{verbatim}
