core-vfd-101/core-vfd.org
** Big dataset creation <<sec:big-dataset-creation>>

   This =lambda= returns a handle to the potentially large dataset in the
   memory-backed HDF5 file. Since the dataset's final size will only be known
   eventually (e.g., end of epoch or transaction), we can't impose a finite
   maximum extent. On line [[(big-sky)]], we set the maxmimum extent as unlimited
   in all (2) dimensions. Currently, the only HDF5 storage layout that supports
   such an arrangement is /chunked storage layout/. By passing a non-default
   dataset creation property list =dcpl= to =H5Dcreate= (line [[(big-dcpl)]]), we
   instruct the HDF5 library to use chunked storage layout instead of the
   default contiguous layout. For chunked layout, we must specify the size of
   an individual chunk in terms of /dataset elements per chunk/; see line
   [[(big-chunk)]]. The size of a chunk in bytes depends on the element datatype.
   In our example (32-bit integers), a 1024^2 chunk occupies 4 MiB of memory
   or storage.

   #+begin_src C -r -n :noweb-ref make-big-2D-dataset

   lambda(hid_t,
     (hid_t file, const char* name, hid_t dtype, const hsize_t* dims, void* buffer),
     {
       hid_t retval;
       hid_t dspace = H5Screate_simple(2, dims,
                                       (hsize_t[]){H5S_UNLIMITED, H5S_UNLIMITED}); // (ref:big-sky)
       hid_t dcpl = H5Pcreate(H5P_DATASET_CREATE);

       H5Pset_chunk(dcpl, 2, (hsize_t[]){1024, 1024}); // (ref:big-chunk)
       retval = H5Dcreate(file, name, dtype, dspace, // (ref:big-dtype1)
                          H5P_DEFAULT, dcpl, H5P_DEFAULT); // (ref:big-dcpl)

       if (buffer)
         H5Dwrite(retval, dtype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer); // (ref:big-dtype2)

       H5Pclose(dcpl);
       H5Sclose(dspace);
       return retval;
     })

   #+end_src

   The same warning and assumptions expressed at the end of section
   [[sec:dataset-creation]] apply to =dtype=.

** Dataset size <<sec:dataset-size>>

   This =lambda= returns the size (in bytes) of the source dataset in the
   memory-backed HDF5 file. It's a matter of determining the storage size
   of an individual dataset element and counting how many there are
   (lines [[(size-calc1)]], [[(size-calc2)]])

   #+begin_src C -r -n :noweb-ref dataset-size

   lambda(hid_t, (hid_t dset),
     {
       size_t retval;
       hid_t ftype = H5Dget_type(dset);
       hid_t dspace = H5Dget_space(dset);

       retval = H5Tget_size(ftype) *  // (ref:size-calc1)
                  (size_t) H5Sget_simple_extent_npoints(dspace); // (ref:size-calc2)

       H5Sclose(dspace);
       H5Tclose(ftype);
       return retval;
     })

   #+end_src

