core-vfd-101/core-vfd.html

<div id="outline-container-orgbe35d3c" class="outline-3">
<h3 id="orgbe35d3c"><span class="section-number-3">5.5</span> Big dataset creation <a id="org69e19b8"></a></h3>
<div class="outline-text-3" id="text-5-5">
<p>
This <code>lambda</code> returns a handle to the potentially large dataset in the
memory-backed HDF5 file. Since the dataset's final size will only be known
eventually (e.g., end of epoch or transaction), we can't impose a finite
maximum extent. On line <a href="#coderef-big-sky" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-big-sky');" onmouseout="CodeHighlightOff(this, 'coderef-big-sky');">6</a>, we set the maxmimum extent as unlimited in
all (2) dimensions. Currently, the only HDF5 storage layout that supports such
an arrangement is <i>chunked storage layout</i>. By passing a non-default dataset
creation property list <code>dcpl</code> to <code>H5Dcreate</code> (line <a href="#coderef-big-dcpl" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-big-dcpl');" onmouseout="CodeHighlightOff(this, 'coderef-big-dcpl');">11</a>), we instruct the
HDF5 library to use chunked storage layout instead of the default contiguous
layout. For chunked layout, we must specify the size of an individual chunk in
terms of <i>dataset elements per chunk</i>; see line <a href="#coderef-big-chunk" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-big-chunk');" onmouseout="CodeHighlightOff(this, 'coderef-big-chunk');">9</a>. The size of a
chunk in bytes depends on the element datatype.  In our example (32-bit
integers), a 1024<sup>2</sup> chunk occupies 4 MiB of memory or storage.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span><span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">hid_t</span>,
<span class="linenr"> 3: </span>       (<span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file</span>, <span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">name</span>, <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dtype</span>, <span style="color: #0000FF;">const</span> <span style="color: #6434A3;">hsize_t</span>* <span style="color: #BA36A5;">dims</span>, <span style="color: #6434A3;">void</span>* <span style="color: #BA36A5;">b</span><span style="color: #BA36A5; background-color: #ff0000;">u</span><span style="color: #BA36A5;">ffer</span>),
<span class="linenr"> 4: </span>       {
<span class="linenr"> 5: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">retval</span>;
<span class="linenr"> 6: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dspace</span> = H5Screate_simple(2, dims,
<span id="coderef-big-sky" class="coderef-off"><span class="linenr"> 7: </span>                                         (<span style="color: #6434A3;">hsize_t</span>[]){H5S_UNLIMITED, H5S_UNLIMIT<span style="background-color: #ff0000;">E</span>D});</span>
<span class="linenr"> 8: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dcpl</span> = H5Pcreate(H5P_DATASET_CREATE);
<span class="linenr"> 9: </span>
<span id="coderef-big-chunk" class="coderef-off"><span class="linenr">10: </span>         H5Pset_chunk(dcpl, 2, (<span style="color: #6434A3;">hsize_t</span>[]){1024, 1024});</span>
<span id="coderef-big-dtype1" class="coderef-off"><span class="linenr">11: </span>         retval = H5Dcreate(file, name, dtype, dspace,</span>
<span id="coderef-big-dcpl" class="coderef-off"><span class="linenr">12: </span>                            H5P_DEFAULT, dcpl, H5P_DEFAULT);</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span>         <span style="color: #0000FF;">if</span> (buffer)
<span id="coderef-big-dtype2" class="coderef-off"><span class="linenr">15: </span>           H5Dwrite(retval, dtype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer);</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span>         H5Pclose(dcpl);
<span class="linenr">18: </span>         H5Sclose(dspace);
<span class="linenr">19: </span>         <span style="color: #0000FF;">return</span> retval;
<span class="linenr">20: </span>       })
<span class="linenr">21: </span>
</pre>
</div>

<p>
The same warning and assumptions expressed at the end of section
<a href="#org5f261c0">5.3</a> apply to <code>dtype</code>.
</p>
</div>
</div>

<div id="outline-container-orge326dd2" class="outline-3">
<h3 id="orge326dd2"><span class="section-number-3">5.6</span> Dataset size <a id="org86a33db"></a></h3>
<div class="outline-text-3" id="text-5-6">
<p>
This <code>lambda</code> returns the size (in bytes) of the source dataset in the
memory-backed HDF5 file. It's a matter of determining the storage size of an
individual dataset element and counting how many there are (lines <a href="#coderef-size-calc1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-size-calc1');" onmouseout="CodeHighlightOff(this, 'coderef-size-calc1');">7</a>,
<a href="#coderef-size-calc2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-size-calc2');" onmouseout="CodeHighlightOff(this, 'coderef-size-calc2');">8</a>)
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span><span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">hid_t</span>, (<span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dset</span>),
<span class="linenr"> 3: </span>       {
<span class="linenr"> 4: </span>         <span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">retval</span>;
<span class="linenr"> 5: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">ftype</span> = H5Dget_type(dset);
<span class="linenr"> 6: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dspace</span> = H5Dget_space(dset);
<span class="linenr"> 7: </span>
<span id="coderef-size-calc1" class="coderef-off"><span class="linenr"> 8: </span>         retval = H5Tget_size(ftype) *</span>
<span id="coderef-size-calc2" class="coderef-off"><span class="linenr"> 9: </span>           (<span style="color: #6434A3;">size_t</span>) H5Sget_simple_extent_npoints(dspace);</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>         H5Sclose(dspace);
<span class="linenr">12: </span>         H5Tclose(ftype);
<span class="linenr">13: </span>         <span style="color: #0000FF;">return</span> retval;
<span class="linenr">14: </span>       })
<span class="linenr">15: </span>
</pre>
</div>
</div>
</div>
