core-vfd-101/core-vfd.tex

\subsection{Big dataset creation \label{org9d4b4ca}}
\label{sec:org4f4542a}

This \texttt{lambda} returns a handle to the potentially large dataset in the
memory-backed HDF5 file. Since the dataset's final size will only be known
eventually (e.g., end of epoch or transaction), we can't impose a finite
maximum extent. On line 6, we set the maxmimum extent as unlimited
in all (2) dimensions. Currently, the only HDF5 storage layout that supports
such an arrangement is \emph{chunked storage layout}. By passing a non-default
dataset creation property list \texttt{dcpl} to \texttt{H5Dcreate} (line 11), we
instruct the HDF5 library to use chunked storage layout instead of the
default contiguous layout. For chunked layout, we must specify the size of
an individual chunk in terms of \emph{dataset elements per chunk}; see line
9. The size of a chunk in bytes depends on the element datatype.
In our example (32-bit integers), a 1024\(^{\text{2}}\) chunk occupies 4 MiB of memory
or storage.

\begin{verbatim}
 1
 2  lambda(hid_t,
 3    (hid_t file, const char* name, hid_t dtype, const hsize_t* dims, void* buffer),
 4    {
 5      hid_t retval;
 6      hid_t dspace = H5Screate_simple(2, dims,
 7                                      (hsize_t[]){H5S_UNLIMITED, H5S_UNLIMITED});
 8      hid_t dcpl = H5Pcreate(H5P_DATASET_CREATE);
 9
10      H5Pset_chunk(dcpl, 2, (hsize_t[]){1024, 1024});
11      retval = H5Dcreate(file, name, dtype, dspace,
12                         H5P_DEFAULT, dcpl, H5P_DEFAULT);
13
14      if (buffer)
15        H5Dwrite(retval, dtype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer);
16
17      H5Pclose(dcpl);
18      H5Sclose(dspace);
19      return retval;
20    })
21
\end{verbatim}

The same warning and assumptions expressed at the end of section
\ref{org38d97dd} apply to \texttt{dtype}.

\subsection{Dataset size \label{orge27ca63}}
\label{sec:org8516942}

This \texttt{lambda} returns the size (in bytes) of the source dataset in the
memory-backed HDF5 file. It's a matter of determining the storage size
of an individual dataset element and counting how many there are
(lines 7, 8)

\begin{verbatim}
 1
 2  lambda(hid_t, (hid_t dset),
 3    {
 4      size_t retval;
 5      hid_t ftype = H5Dget_type(dset);
 6      hid_t dspace = H5Dget_space(dset);
 7
 8      retval = H5Tget_size(ftype) *
 9                 (size_t) H5Sget_simple_extent_npoints(dspace);
10
11      H5Sclose(dspace);
12      H5Tclose(ftype);
13      return retval;
14    })
15
\end{verbatim}
