core-vfd-101/core-vfd.org
** Compact replica <<sec:compact-replica>>

   This =lambda= returns a handle to the freshly minted compact replica of
   the source dataset. (It's a placeholder, because the actual values are
   transferred separately.)

   What sets this dataset creation apart from the default case occurs on lines
   [[(compact-layout)]]-[[(compact-dcpl)]]. By passing a non-default dataset creation
   property list =dcpl= to =H5Dcreate=, we instruct the HDF5 library to use compact
   storage layout instead of the default contiguous (=H5D_CONTIGUOUS=) layout.

   #+begin_src C -r -n :noweb-ref create-compact

   lambda(hid_t, (hid_t src_dset, hid_t file, const char* name),
     {
       hid_t retval;
       hid_t ftype = H5Dget_type(src_dset);
       hid_t src_dspace = H5Dget_space(src_dset); // (ref:compact-src)
       hid_t dcpl = H5Pcreate(H5P_DATASET_CREATE);

       hid_t dspace = H5Scopy(src_dspace); // (ref:compact1)
       hsize_t dims[H5S_MAX_RANK]; // (ref:compact-max-rank)
       H5Sget_simple_extent_dims(dspace, dims, NULL);
       H5Sset_extent_simple(dspace, H5Sget_simple_extent_ndims(dspace),
                            dims, NULL); // (ref:compact2)

       H5Pset_layout(dcpl, H5D_COMPACT); // (ref:compact-layout)
       retval = H5Dcreate(file, name, ftype, dspace,
                          H5P_DEFAULT, dcpl, H5P_DEFAULT); // (ref:compact-dcpl)

       H5Pclose(dcpl);
       H5Sclose(dspace);
       H5Tclose(ftype);
       return retval;
     })

   #+end_src

   Two other things are worth mentioning about this snippet.

   1. The dataspace construction on lines [[(compact1)]]-[[(compact2)]] appears a
      little clumsy. Since the extent of the source dataset =src_dset= is not
      changing, why not just work with =src_dspace= (line [[(compact-src)]])? The
      reason is that dataspaces with =H5S_UNLIMITED= extent bounds, for obvious
      reasons, are not supported with compact layout. In that case, in our
      example (!), passing =src_dspace= as an argument to =H5Dcreate= would
      generate an error. It's easier to just create a copy of the dataspace and
      "kill" (=NULL=) whatever maximum extent there might be.
   2. On line [[(compact-max-rank)]], we use the HDF5 library macro
      =H5S_MAX_RANK= to avoid the dynamic allocation of the =dims= array.

** Data transfer <<sec:dataset-xfer>>

   The HDF5 library does not currently have a function to "automagically"
   transfer data between two datasets, especially datasets with different
   storage layouts. There is not much else we can do but to read (line
   [[(xfer-read)]]) the data from the source dataset and to write (line
   [[(xfer-write)]]) to the destination dataset.

   Since we transfer the data through memory, we need to determine first the
   size of the transfer buffer needed (line [[(xfer-size)]]).

   #+begin_src C -r -n :noweb-ref xfer-data

   lambda(void, (hid_t src, hid_t dst),
     {
       hid_t ftype = H5Dget_type(src);
       hid_t dspace = H5Dget_space(src);
       size_t size = H5Tget_size(ftype) * H5Sget_simple_extent_npoints(dspace); // (ref:xfer-size)
       char* buffer = (char*) malloc(size);

       H5Dread(src, ftype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer); // (ref:xfer-read)
       H5Dwrite(dst, ftype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer); // (ref:xfer-write)

       free(buffer);
       H5Sclose(dspace);
       H5Tclose(ftype);
     })

   #+end_src

* Appendix

