core-vfd-101/core-vfd.html

<div id="outline-container-org35417b7" class="outline-3">
<h3 id="org35417b7"><span class="section-number-3">5.7</span> Compact replica <a id="orgb46619a"></a></h3>
<div class="outline-text-3" id="text-5-7">
<p>
This <code>lambda</code> returns a handle to the freshly minted compact replica of the
source dataset. (It's a placeholder, because the actual values are transferred
separately.)
</p>

<p>
What sets this dataset creation apart from the default case occurs on lines
<a href="#coderef-compact-layout" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compact-layout');" onmouseout="CodeHighlightOff(this, 'coderef-compact-layout');">14</a>-<a href="#coderef-compact-dcpl" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compact-dcpl');" onmouseout="CodeHighlightOff(this, 'coderef-compact-dcpl');">16</a>. By passing a non-default dataset creation
property list <code>dcpl</code> to <code>H5Dcreate</code>, we instruct the HDF5 library to use
compact storage layout instead of the default contiguous (<code>H5D_CONTIGUOUS</code>)
layout.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span><span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">hid_t</span>, (<span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">src_dset</span>, <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">file</span>, <span style="color: #0000FF;">const</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">name</span>),
<span class="linenr"> 3: </span>       {
<span class="linenr"> 4: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">retval</span>;
<span class="linenr"> 5: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">ftype</span> = H5Dget_type(src_dset);
<span id="coderef-compact-src" class="coderef-off"><span class="linenr"> 6: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">src_dspace</span> = H5Dget_space(src_dset);</span>
<span class="linenr"> 7: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dcpl</span> = H5Pcreate(H5P_DATASET_CREATE);
<span class="linenr"> 8: </span>
<span id="coderef-compact1" class="coderef-off"><span class="linenr"> 9: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dspace</span> = H5Scopy(src_dspace);</span>
<span id="coderef-compact-max-rank" class="coderef-off"><span class="linenr">10: </span>         <span style="color: #6434A3;">hsize_t</span> <span style="color: #BA36A5;">dims</span>[H5S_MAX_RANK];</span>
<span class="linenr">11: </span>         H5Sget_simple_extent_dims(dspace, dims, <span style="color: #D0372D;">NULL</span>);
<span class="linenr">12: </span>         H5Sset_extent_simple(dspace, <span style="color: #6434A3;">H5Sget_simple_extent_ndims</span>(<span style="color: #BA36A5;">dspace</span>),
<span id="coderef-compact2" class="coderef-off"><span class="linenr">13: </span>                              dims, <span style="color: #D0372D;">NULL</span>);</span>
<span class="linenr">14: </span>
<span id="coderef-compact-layout" class="coderef-off"><span class="linenr">15: </span>         H5Pset_layout(dcpl, H5D_COMPACT);</span>
<span class="linenr">16: </span>         retval = H5Dcreate(file, name, ftype, dspace,
<span id="coderef-compact-dcpl" class="coderef-off"><span class="linenr">17: </span>                            H5P_DEFAULT, dcpl, H5P_DEFAULT);</span>
<span class="linenr">18: </span>
<span class="linenr">19: </span>         H5Pclose(dcpl);
<span class="linenr">20: </span>         H5Sclose(dspace);
<span class="linenr">21: </span>         H5Tclose(ftype);
<span class="linenr">22: </span>         <span style="color: #0000FF;">return</span> retval;
<span class="linenr">23: </span>       })
<span class="linenr">24: </span>
</pre>
</div>

<p>
Two other things are worth mentioning about this snippet.
</p>

<ol class="org-ol">
<li>The dataspace construction on lines <a href="#coderef-compact1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compact1');" onmouseout="CodeHighlightOff(this, 'coderef-compact1');">8</a>-<a href="#coderef-compact2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compact2');" onmouseout="CodeHighlightOff(this, 'coderef-compact2');">12</a> appears a little
clumsy. Since the extent of the source dataset <code>src_dset</code> is not changing,
why not just work with <code>src_dspace</code> (line <a href="#coderef-compact-src" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compact-src');" onmouseout="CodeHighlightOff(this, 'coderef-compact-src');">5</a>)? The reason is that
dataspaces with <code>H5S_UNLIMITED</code> extent bounds, for obvious reasons, are not
supported with compact layout. In that case, in our example (!), passing
<code>src_dspace</code> as an argument to <code>H5Dcreate</code> would generate an error. It's
easier to just create a copy of the dataspace and "kill" (<code>NULL</code>) whatever
maximum extent there might be.</li>
<li>On line <a href="#coderef-compact-max-rank" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-compact-max-rank');" onmouseout="CodeHighlightOff(this, 'coderef-compact-max-rank');">9</a>, we use the HDF5 library macro <code>H5S_MAX_RANK</code> to
avoid the dynamic allocation of the <code>dims</code> array.</li>
</ol>
</div>
</div>

<div id="outline-container-orge16b956" class="outline-3">
<h3 id="orge16b956"><span class="section-number-3">5.8</span> Data transfer <a id="org07a75fe"></a></h3>
<div class="outline-text-3" id="text-5-8">
<p>
The HDF5 library does not currently have a function to "automagically" transfer
data between two datasets, especially datasets with different storage
layouts. There is not much else we can do but to read (line <a href="#coderef-xfer-read" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-xfer-read');" onmouseout="CodeHighlightOff(this, 'coderef-xfer-read');">8</a>) the
data from the source dataset and to write (line <a href="#coderef-xfer-write" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-xfer-write');" onmouseout="CodeHighlightOff(this, 'coderef-xfer-write');">9</a>) to the
destination dataset.
</p>

<p>
Since we transfer the data through memory, we need to determine first the size
of the transfer buffer needed (line <a href="#coderef-xfer-size" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-xfer-size');" onmouseout="CodeHighlightOff(this, 'coderef-xfer-size');">5</a>).
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span><span style="color: #006699;">lambda</span>(<span style="color: #6434A3;">void</span>, (<span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">src</span>, <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dst</span>),
<span class="linenr"> 3: </span>       {
<span class="linenr"> 4: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">ftype</span> = H5Dget_type(src);
<span class="linenr"> 5: </span>         <span style="color: #6434A3;">hid_t</span> <span style="color: #BA36A5;">dspace</span> = H5Dget_space(src);
<span id="coderef-xfer-size" class="coderef-off"><span class="linenr"> 6: </span>         <span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">size</span> = H5Tget_size(ftype) * H5Sget_simple_extent_npoints(dspace<span style="background-color: #ff0000;">)</span>;</span>
<span class="linenr"> 7: </span>         <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">buffer</span> = (<span style="color: #6434A3;">char</span>*) malloc(size);
<span class="linenr"> 8: </span>
<span id="coderef-xfer-read" class="coderef-off"><span class="linenr"> 9: </span>         H5Dread(src, ftype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer);</span>
<span id="coderef-xfer-write" class="coderef-off"><span class="linenr">10: </span>         H5Dwrite(dst, ftype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer);</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>         free(buffer);
<span class="linenr">13: </span>         H5Sclose(dspace);
<span class="linenr">14: </span>         H5Tclose(ftype);
<span class="linenr">15: </span>       })
<span class="linenr">16: </span>
</pre>
</div>
</div>
</div>
</div>
