core-vfd-101/core-vfd.tex

\subsection{Compact replica \label{org563ffcf}}
\label{sec:org1a60af2}

This \texttt{lambda} returns a handle to the freshly minted compact replica of
the source dataset. (It's a placeholder, because the actual values are
transferred separately.)

What sets this dataset creation apart from the default case occurs on lines
14-16. By passing a non-default dataset creation
property list \texttt{dcpl} to \texttt{H5Dcreate}, we instruct the HDF5 library to use compact
storage layout instead of the default contiguous (\texttt{H5D\_CONTIGUOUS}) layout.

\begin{verbatim}
 1
 2  lambda(hid_t, (hid_t src_dset, hid_t file, const char* name),
 3    {
 4      hid_t retval;
 5      hid_t ftype = H5Dget_type(src_dset);
 6      hid_t src_dspace = H5Dget_space(src_dset);
 7      hid_t dcpl = H5Pcreate(H5P_DATASET_CREATE);
 8
 9      hid_t dspace = H5Scopy(src_dspace);
10      hsize_t dims[H5S_MAX_RANK];
11      H5Sget_simple_extent_dims(dspace, dims, NULL);
12      H5Sset_extent_simple(dspace, H5Sget_simple_extent_ndims(dspace),
13                           dims, NULL);
14
15      H5Pset_layout(dcpl, H5D_COMPACT);
16      retval = H5Dcreate(file, name, ftype, dspace,
17                         H5P_DEFAULT, dcpl, H5P_DEFAULT);
18
19      H5Pclose(dcpl);
20      H5Sclose(dspace);
21      H5Tclose(ftype);
22      return retval;
23    })
24
\end{verbatim}

Two other things are worth mentioning about this snippet.

\begin{enumerate}
\item The dataspace construction on lines 8-12 appears a
little clumsy. Since the extent of the source dataset \texttt{src\_dset} is not
changing, why not just work with \texttt{src\_dspace} (line 5)? The
reason is that dataspaces with \texttt{H5S\_UNLIMITED} extent bounds, for obvious
reasons, are not supported with compact layout. In that case, in our
example (!), passing \texttt{src\_dspace} as an argument to \texttt{H5Dcreate} would
generate an error. It's easier to just create a copy of the dataspace and
"kill" (\texttt{NULL}) whatever maximum extent there might be.
\item On line 9, we use the HDF5 library macro
\texttt{H5S\_MAX\_RANK} to avoid the dynamic allocation of the \texttt{dims} array.
\end{enumerate}

\subsection{Data transfer \label{org01157bd}}
\label{sec:org03b7667}

The HDF5 library does not currently have a function to "automagically"
transfer data between two datasets, especially datasets with different
storage layouts. There is not much else we can do but to read (line
8) the data from the source dataset and to write (line
9) to the destination dataset.

Since we transfer the data through memory, we need to determine first the
size of the transfer buffer needed (line 5).

\begin{verbatim}
 1
 2  lambda(void, (hid_t src, hid_t dst),
 3    {
 4      hid_t ftype = H5Dget_type(src);
 5      hid_t dspace = H5Dget_space(src);
 6      size_t size = H5Tget_size(ftype) * H5Sget_simple_extent_npoints(dspace);
 7      char* buffer = (char*) malloc(size);
 8
 9      H5Dread(src, ftype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer);
10      H5Dwrite(dst, ftype, H5S_ALL, H5S_ALL, H5P_DEFAULT, buffer);
11
12      free(buffer);
13      H5Sclose(dspace);
14      H5Tclose(ftype);
15    })
16
\end{verbatim}
