core-vfd-101/core-vfd.org
** Versions
   This document was tested with the following software versions:

   #+begin_src emacs-lisp :exports both

   (princ (concat
           (format "Emacs version: %s\n"
                   (emacs-version))
           (format "org version: %s\n"
                   (org-version))))

   #+end_src

   #+RESULTS:
   : Emacs version: GNU Emacs 26.1 (build 2, x86_64-pc-linux-gnu, GTK+ Version 3.24.5)
   :  of 2019-09-22, modified by Debian
   : org version: 9.1.9

   #+begin_src sh :exports both :results output

   gcc --version

   #+end_src

   #+RESULTS:
   : gcc (Debian 8.3.0-6) 8.3.0
   : Copyright (C) 2018 Free Software Foundation, Inc.
   : This is free software; see the source for copying conditions.  There is NO
   : warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
   :

** Boilerplate with a twist
   These are the header files needed to build the examples.

   #+begin_src C :noweb-ref boilerplate

   #include "hdf5.h"

   #include <stdio.h>
   #include <stdlib.h>

   #+end_src

   The more interesting bit is the =lambda= macro by [[https://hackaday.com/2019/09/11/lambdas-for-c-sort-of/][Al Williams]].

   #+begin_src C -n :noweb-ref boilerplate

   #define lambda(lambda$_ret, lambda$_args, lambda$_body) \
     ({                                                    \
       lambda$_ret lambda$__anon$ lambda$_args             \
         lambda$_body                                      \
         &lambda$__anon$;                                  \
     })

   #+end_src

   It uses two features of GNU C (=--std=gnu99=), namely, [[http://gcc.gnu.org/onlinedocs/gcc/Nested-Functions.html][nested functions]] and
   [[https://gcc.gnu.org/onlinedocs/gcc/Statement-Exprs.html][statement expressions]], which lets us wrap C code blocks as "lambda
   functions", thereby making longer pieces of code easier to follow and
   digest.

   #+begin_example

   lambda(<return type>, ([type1 arg1, type2 arg2, ...]), { <lambda body>  })

   #+end_example

   Such a =lambda= can then be invoked like a C-function pointer:

   #+begin_src C -n :tangle src/lambda.c :exports both

   #define lambda(lambda$_ret, lambda$_args, lambda$_body) \
     ({                                                    \
       lambda$_ret lambda$__anon$ lambda$_args             \
         lambda$_body                                      \
         &lambda$__anon$;                                  \
     })

   int main()
   {
     printf("%f\n",(*lambda(float, (float x), { return x*x; }))(2.0));
     return 0;
   }

   #+end_src

   #+RESULTS:
   : 4.0

# Local Variables:
# org-coderef-label-format: "// (ref:%s)"
# End:
