core-vfd-101/core-vfd.html

<div id="outline-container-org0812f2a" class="outline-2">
<h2 id="org0812f2a"><span class="section-number-2">6</span> Appendix</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgf71a32e" class="outline-3">
<h3 id="orgf71a32e"><span class="section-number-3">6.1</span> Versions</h3>
<div class="outline-text-3" id="text-6-1">
<p>
This document was tested with the following software versions:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(princ (concat
        (format <span style="color: #008000;">"Emacs version: %s\n"</span>
                (emacs-version))
        (format <span style="color: #008000;">"org version: %s\n"</span>
                (org-version))))

</pre>
</div>

<pre class="example">
Emacs version: GNU Emacs 26.1 (build 2, x86_64-pc-linux-gnu, GTK+ Version 3.24.5)
 of 2019-09-22, modified by Debian
org version: 9.1.9

</pre>

<div class="org-src-container">
<pre class="src src-sh">
gcc --version

</pre>
</div>

<pre class="example">
gcc (Debian 8.3.0-6) 8.3.0
Copyright (C) 2018 Free Software Foundation, Inc.
This is free software; see the source for copying conditions.  There is NO
warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.


</pre>
</div>
</div>

<div id="outline-container-orgc6a721b" class="outline-3">
<h3 id="orgc6a721b"><span class="section-number-3">6.2</span> Boilerplate with a twist</h3>
<div class="outline-text-3" id="text-6-2">
<p>
These are the header files needed to build the examples.
</p>

<div class="org-src-container">
<pre class="src src-C">
<span style="color: #808080;">#include</span> <span style="color: #008000;">"hdf5.h"</span>

<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;stdio.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;stdlib.h&gt;</span>

</pre>
</div>

<p>
The more interesting bit is the <code>lambda</code> macro by <a href="https://hackaday.com/2019/09/11/lambdas-for-c-sort-of/">Al Williams</a>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr">1: </span>
<span class="linenr">2: </span><span style="color: #808080;">#define</span> <span style="color: #006699;">lambda</span>(<span style="color: #BA36A5;">lambda$_ret</span>, <span style="color: #BA36A5;">lambda$_args</span>, <span style="color: #BA36A5;">lambda$_body</span>) \
<span class="linenr">3: </span>  ({                                                    \
<span class="linenr">4: </span>    lambda$_ret lambda$__anon$ <span style="color: #6434A3;">lambda$_args</span>             \
<span class="linenr">5: </span>      <span style="color: #BA36A5;">lambda$_body</span>                                      \
<span class="linenr">6: </span>      &amp;lambda$__anon$;                                  \
<span class="linenr">7: </span>  })
<span class="linenr">8: </span>
</pre>
</div>

<p>
It uses two features of GNU C (<code>--std=gnu99</code>), namely, <a href="http://gcc.gnu.org/onlinedocs/gcc/Nested-Functions.html">nested functions</a> and
<a href="https://gcc.gnu.org/onlinedocs/gcc/Statement-Exprs.html">statement expressions</a>, which lets us wrap C code blocks as "lambda functions",
thereby making longer pieces of code easier to follow and digest.
</p>

<pre class="example">

lambda(&lt;return type&gt;, ([type1 arg1, type2 arg2, ...]), { &lt;lambda body&gt;  })

</pre>

<p>
Such a <code>lambda</code> can then be invoked like a C-function pointer:
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span><span style="color: #808080;">#define</span> <span style="color: #006699;">lambda</span>(<span style="color: #BA36A5;">lambda$_ret</span>, <span style="color: #BA36A5;">lambda$_args</span>, <span style="color: #BA36A5;">lambda$_body</span>) \
<span class="linenr"> 3: </span>  ({                                                    \
<span class="linenr"> 4: </span>    lambda$_ret lambda$__anon$ <span style="color: #6434A3;">lambda$_args</span>             \
<span class="linenr"> 5: </span>      <span style="color: #BA36A5;">lambda$_body</span>                                      \
<span class="linenr"> 6: </span>      &amp;lambda$__anon$;                                  \
<span class="linenr"> 7: </span>  })
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span>()
<span class="linenr">10: </span>{
<span class="linenr">11: </span>  printf(<span style="color: #008000;">"%f\n"</span>,(*lambda(<span style="color: #6434A3;">float</span>, (<span style="color: #6434A3;">float</span> <span style="color: #BA36A5;">x</span>), { <span style="color: #0000FF;">return</span> x*x; }))(2.0));
<span class="linenr">12: </span>  <span style="color: #0000FF;">return</span> 0;
<span class="linenr">13: </span>}
<span class="linenr">14: </span>
</pre>
</div>

<pre class="example">
4.0

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 17 December 2020</p>
<p class="author">Author: Gerd Heber</p>
<p class="date">Created: 2020-12-27 Sun 16:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
