core-vfd-101/core-vfd.tex

\section{Appendix}
\label{sec:org7bc92a7}

\subsection{Versions}
\label{sec:org5a092bd}
This document was tested with the following software versions:

\begin{verbatim}

(princ (concat
        (format "Emacs version: %s\n"
                (emacs-version))
        (format "org version: %s\n"
                (org-version))))

\end{verbatim}

\begin{verbatim}
Emacs version: GNU Emacs 26.1 (build 2, x86_64-pc-linux-gnu, GTK+ Version 3.24.5)
 of 2019-09-22, modified by Debian
org version: 9.1.9
\end{verbatim}

\begin{verbatim}

gcc --version

\end{verbatim}

\begin{verbatim}
gcc (Debian 8.3.0-6) 8.3.0
Copyright (C) 2018 Free Software Foundation, Inc.
This is free software; see the source for copying conditions.  There is NO
warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.

\end{verbatim}

\subsection{Boilerplate with a twist}
\label{sec:orgd07fd63}
These are the header files needed to build the examples.

\begin{verbatim}

#include "hdf5.h"

#include <stdio.h>
#include <stdlib.h>

\end{verbatim}

The more interesting bit is the \texttt{lambda} macro by \href{https://hackaday.com/2019/09/11/lambdas-for-c-sort-of/}{Al Williams}.

\begin{verbatim}
1
2  #define lambda(lambda$_ret, lambda$_args, lambda$_body) \
3    ({                                                    \
4      lambda$_ret lambda$__anon$ lambda$_args             \
5        lambda$_body                                      \
6        &lambda$__anon$;                                  \
7    })
8
\end{verbatim}

It uses two features of GNU C (\texttt{-{}-std=gnu99}), namely, \href{http://gcc.gnu.org/onlinedocs/gcc/Nested-Functions.html}{nested functions} and
\href{https://gcc.gnu.org/onlinedocs/gcc/Statement-Exprs.html}{statement expressions}, which lets us wrap C code blocks as "lambda
functions", thereby making longer pieces of code easier to follow and
digest.

\begin{verbatim}

lambda(<return type>, ([type1 arg1, type2 arg2, ...]), { <lambda body>  })

\end{verbatim}

Such a \texttt{lambda} can then be invoked like a C-function pointer:

\begin{verbatim}
 1
 2  #define lambda(lambda$_ret, lambda$_args, lambda$_body) \
 3    ({                                                    \
 4      lambda$_ret lambda$__anon$ lambda$_args             \
 5        lambda$_body                                      \
 6        &lambda$__anon$;                                  \
 7    })
 8
 9  int main()
10  {
11    printf("%f\n",(*lambda(float, (float x), { return x*x; }))(2.0));
12    return 0;
13  }
14
\end{verbatim}

\begin{verbatim}
4.0
\end{verbatim}
\end{document}
